#![allow(
    clippy::all,
    warnings
)]
/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::core::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::core::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::core::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
#[repr(C)]
pub struct __BindgenUnionField<T>(::core::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::core::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::core::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::core::mem::transmute(self)
    }
}

pub const SYS_setregid: u32 = 114;
pub const SYS_setresgid: u32 = 119;
pub const SYS_setresuid: u32 = 117;
pub const SYS_setreuid: u32 = 113;
pub const SYS_setrlimit: u32 = 160;
pub const SYS_setsid: u32 = 112;
pub const SYS_setsockopt: u32 = 54;
pub const SYS_settimeofday: u32 = 164;
pub const SYS_setuid: u32 = 105;
pub const SYS_setxattr: u32 = 188;
pub const SYS_setxattrat: u32 = 463;
pub const SYS_shmat: u32 = 30;
pub const SYS_shmctl: u32 = 31;
pub const SYS_shmdt: u32 = 67;
pub const SYS_shmget: u32 = 29;
pub const SYS_shutdown: u32 = 48;
pub const SYS_sigaltstack: u32 = 131;
pub const SYS_signalfd: u32 = 282;
pub const SYS_signalfd4: u32 = 289;
pub const SYS_socket: u32 = 41;
pub const SYS_socketpair: u32 = 53;
pub const SYS_splice: u32 = 275;
pub const SYS_stat: u32 = 4;
pub const SYS_statfs: u32 = 137;
pub const SYS_statmount: u32 = 457;
pub const SYS_statx: u32 = 332;
pub const SYS_swapoff: u32 = 168;
pub const SYS_swapon: u32 = 167;
pub const SYS_symlink: u32 = 88;
pub const SYS_symlinkat: u32 = 266;
pub const SYS_sync: u32 = 162;
pub const SYS_sync_file_range: u32 = 277;
pub const SYS_syncfs: u32 = 306;
pub const SYS_sysfs: u32 = 139;
pub const SYS_sysinfo: u32 = 99;
pub const SYS_syslog: u32 = 103;
pub const SYS_tee: u32 = 276;
pub const SYS_tgkill: u32 = 234;
pub const SYS_time: u32 = 201;
pub const SYS_timer_create: u32 = 222;
pub const SYS_timer_delete: u32 = 226;
pub const SYS_timer_getoverrun: u32 = 225;
pub const SYS_timer_gettime: u32 = 224;
pub const SYS_timer_settime: u32 = 223;
pub const SYS_timerfd_create: u32 = 283;
pub const SYS_timerfd_gettime: u32 = 287;
pub const SYS_timerfd_settime: u32 = 286;
pub const SYS_times: u32 = 100;
pub const SYS_tkill: u32 = 200;
pub const SYS_truncate: u32 = 76;
pub const SYS_tuxcall: u32 = 184;
pub const SYS_umask: u32 = 95;
pub const SYS_umount2: u32 = 166;
pub const SYS_uname: u32 = 63;
pub const SYS_unlink: u32 = 87;
pub const SYS_unlinkat: u32 = 263;
pub const SYS_unshare: u32 = 272;
pub const SYS_uretprobe: u32 = 335;
pub const SYS_uselib: u32 = 134;
pub const SYS_userfaultfd: u32 = 323;
pub const SYS_ustat: u32 = 136;
pub const SYS_utime: u32 = 132;
pub const SYS_utimensat: u32 = 280;
pub const SYS_utimes: u32 = 235;
pub const SYS_vfork: u32 = 58;
pub const SYS_vhangup: u32 = 153;
pub const SYS_vmsplice: u32 = 278;
pub const SYS_vserver: u32 = 236;
pub const SYS_wait4: u32 = 61;
pub const SYS_waitid: u32 = 247;
pub const SYS_write: u32 = 1;
pub const SYS_writev: u32 = 20;
pub type __s8 = ::core::ffi::c_schar;
pub type __u8 = ::core::ffi::c_uchar;
pub type __s16 = ::core::ffi::c_short;
pub type __u16 = ::core::ffi::c_ushort;
pub type __s32 = ::core::ffi::c_int;
pub type __u32 = ::core::ffi::c_uint;
pub type __s64 = ::core::ffi::c_longlong;
pub type __u64 = ::core::ffi::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::core::ffi::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::core::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::core::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::core::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int)>;
pub type __kernel_key_t = ::core::ffi::c_int;
pub type __kernel_mqd_t = ::core::ffi::c_int;
pub type __kernel_old_uid_t = ::core::ffi::c_ushort;
pub type __kernel_old_gid_t = ::core::ffi::c_ushort;
pub type __kernel_old_dev_t = ::core::ffi::c_ulong;
pub type __kernel_long_t = ::core::ffi::c_long;
pub type __kernel_ulong_t = ::core::ffi::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::core::ffi::c_uint;
pub type __kernel_pid_t = ::core::ffi::c_int;
pub type __kernel_ipc_pid_t = ::core::ffi::c_int;
pub type __kernel_uid_t = ::core::ffi::c_uint;
pub type __kernel_gid_t = ::core::ffi::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::core::ffi::c_int;
pub type __kernel_uid32_t = ::core::ffi::c_uint;
pub type __kernel_gid32_t = ::core::ffi::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::core::ffi::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::core::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::core::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::core::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::core::ffi::c_longlong;
pub type __kernel_uoff_t = ::core::ffi::c_ulonglong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::core::ffi::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::core::ffi::c_int;
pub type __kernel_clockid_t = ::core::ffi::c_int;
pub type __kernel_caddr_t = *mut ::core::ffi::c_char;
pub type __kernel_uid16_t = ::core::ffi::c_ushort;
pub type __kernel_gid16_t = ::core::ffi::c_ushort;
pub type __s128 = i128;
pub type __u128 = u128;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fscrypt_policy_v1 {
    pub version: __u8,
    pub contents_encryption_mode: __u8,
    pub filenames_encryption_mode: __u8,
    pub flags: __u8,
    pub master_key_descriptor: [__u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_policy_v1"][::core::mem::size_of::<fscrypt_policy_v1>() - 12usize];
    ["Alignment of fscrypt_policy_v1"][::core::mem::align_of::<fscrypt_policy_v1>() - 1usize];
    ["Offset of field: fscrypt_policy_v1::version"]
        [::core::mem::offset_of!(fscrypt_policy_v1, version) - 0usize];
    ["Offset of field: fscrypt_policy_v1::contents_encryption_mode"]
        [::core::mem::offset_of!(fscrypt_policy_v1, contents_encryption_mode) - 1usize];
    ["Offset of field: fscrypt_policy_v1::filenames_encryption_mode"]
        [::core::mem::offset_of!(fscrypt_policy_v1, filenames_encryption_mode) - 2usize];
    ["Offset of field: fscrypt_policy_v1::flags"]
        [::core::mem::offset_of!(fscrypt_policy_v1, flags) - 3usize];
    ["Offset of field: fscrypt_policy_v1::master_key_descriptor"]
        [::core::mem::offset_of!(fscrypt_policy_v1, master_key_descriptor) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fscrypt_key {
    pub mode: __u32,
    pub raw: [__u8; 64usize],
    pub size: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_key"][::core::mem::size_of::<fscrypt_key>() - 72usize];
    ["Alignment of fscrypt_key"][::core::mem::align_of::<fscrypt_key>() - 4usize];
    ["Offset of field: fscrypt_key::mode"][::core::mem::offset_of!(fscrypt_key, mode) - 0usize];
    ["Offset of field: fscrypt_key::raw"][::core::mem::offset_of!(fscrypt_key, raw) - 4usize];
    ["Offset of field: fscrypt_key::size"][::core::mem::offset_of!(fscrypt_key, size) - 68usize];
};
impl Default for fscrypt_key {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fscrypt_policy_v2 {
    pub version: __u8,
    pub contents_encryption_mode: __u8,
    pub filenames_encryption_mode: __u8,
    pub flags: __u8,
    pub log2_data_unit_size: __u8,
    pub __reserved: [__u8; 3usize],
    pub master_key_identifier: [__u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_policy_v2"][::core::mem::size_of::<fscrypt_policy_v2>() - 24usize];
    ["Alignment of fscrypt_policy_v2"][::core::mem::align_of::<fscrypt_policy_v2>() - 1usize];
    ["Offset of field: fscrypt_policy_v2::version"]
        [::core::mem::offset_of!(fscrypt_policy_v2, version) - 0usize];
    ["Offset of field: fscrypt_policy_v2::contents_encryption_mode"]
        [::core::mem::offset_of!(fscrypt_policy_v2, contents_encryption_mode) - 1usize];
    ["Offset of field: fscrypt_policy_v2::filenames_encryption_mode"]
        [::core::mem::offset_of!(fscrypt_policy_v2, filenames_encryption_mode) - 2usize];
    ["Offset of field: fscrypt_policy_v2::flags"]
        [::core::mem::offset_of!(fscrypt_policy_v2, flags) - 3usize];
    ["Offset of field: fscrypt_policy_v2::log2_data_unit_size"]
        [::core::mem::offset_of!(fscrypt_policy_v2, log2_data_unit_size) - 4usize];
    ["Offset of field: fscrypt_policy_v2::__reserved"]
        [::core::mem::offset_of!(fscrypt_policy_v2, __reserved) - 5usize];
    ["Offset of field: fscrypt_policy_v2::master_key_identifier"]
        [::core::mem::offset_of!(fscrypt_policy_v2, master_key_identifier) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fscrypt_get_policy_ex_arg {
    pub policy_size: __u64,
    pub policy: fscrypt_get_policy_ex_arg__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fscrypt_get_policy_ex_arg__bindgen_ty_1 {
    pub version: __u8,
    pub v1: fscrypt_policy_v1,
    pub v2: fscrypt_policy_v2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_get_policy_ex_arg__bindgen_ty_1"]
        [::core::mem::size_of::<fscrypt_get_policy_ex_arg__bindgen_ty_1>() - 24usize];
    ["Alignment of fscrypt_get_policy_ex_arg__bindgen_ty_1"]
        [::core::mem::align_of::<fscrypt_get_policy_ex_arg__bindgen_ty_1>() - 1usize];
    ["Offset of field: fscrypt_get_policy_ex_arg__bindgen_ty_1::version"]
        [::core::mem::offset_of!(fscrypt_get_policy_ex_arg__bindgen_ty_1, version) - 0usize];
    ["Offset of field: fscrypt_get_policy_ex_arg__bindgen_ty_1::v1"]
        [::core::mem::offset_of!(fscrypt_get_policy_ex_arg__bindgen_ty_1, v1) - 0usize];
    ["Offset of field: fscrypt_get_policy_ex_arg__bindgen_ty_1::v2"]
        [::core::mem::offset_of!(fscrypt_get_policy_ex_arg__bindgen_ty_1, v2) - 0usize];
};
impl Default for fscrypt_get_policy_ex_arg__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_get_policy_ex_arg"]
        [::core::mem::size_of::<fscrypt_get_policy_ex_arg>() - 32usize];
    ["Alignment of fscrypt_get_policy_ex_arg"]
        [::core::mem::align_of::<fscrypt_get_policy_ex_arg>() - 8usize];
    ["Offset of field: fscrypt_get_policy_ex_arg::policy_size"]
        [::core::mem::offset_of!(fscrypt_get_policy_ex_arg, policy_size) - 0usize];
    ["Offset of field: fscrypt_get_policy_ex_arg::policy"]
        [::core::mem::offset_of!(fscrypt_get_policy_ex_arg, policy) - 8usize];
};
impl Default for fscrypt_get_policy_ex_arg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fscrypt_key_specifier {
    pub type_: __u32,
    pub __reserved: __u32,
    pub u: fscrypt_key_specifier__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fscrypt_key_specifier__bindgen_ty_1 {
    pub __reserved: [__u8; 32usize],
    pub descriptor: [__u8; 8usize],
    pub identifier: [__u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_key_specifier__bindgen_ty_1"]
        [::core::mem::size_of::<fscrypt_key_specifier__bindgen_ty_1>() - 32usize];
    ["Alignment of fscrypt_key_specifier__bindgen_ty_1"]
        [::core::mem::align_of::<fscrypt_key_specifier__bindgen_ty_1>() - 1usize];
    ["Offset of field: fscrypt_key_specifier__bindgen_ty_1::__reserved"]
        [::core::mem::offset_of!(fscrypt_key_specifier__bindgen_ty_1, __reserved) - 0usize];
    ["Offset of field: fscrypt_key_specifier__bindgen_ty_1::descriptor"]
        [::core::mem::offset_of!(fscrypt_key_specifier__bindgen_ty_1, descriptor) - 0usize];
    ["Offset of field: fscrypt_key_specifier__bindgen_ty_1::identifier"]
        [::core::mem::offset_of!(fscrypt_key_specifier__bindgen_ty_1, identifier) - 0usize];
};
impl Default for fscrypt_key_specifier__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_key_specifier"][::core::mem::size_of::<fscrypt_key_specifier>() - 40usize];
    ["Alignment of fscrypt_key_specifier"]
        [::core::mem::align_of::<fscrypt_key_specifier>() - 4usize];
    ["Offset of field: fscrypt_key_specifier::type_"]
        [::core::mem::offset_of!(fscrypt_key_specifier, type_) - 0usize];
    ["Offset of field: fscrypt_key_specifier::__reserved"]
        [::core::mem::offset_of!(fscrypt_key_specifier, __reserved) - 4usize];
    ["Offset of field: fscrypt_key_specifier::u"]
        [::core::mem::offset_of!(fscrypt_key_specifier, u) - 8usize];
};
impl Default for fscrypt_key_specifier {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct fscrypt_provisioning_key_payload {
    pub type_: __u32,
    pub flags: __u32,
    pub raw: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_provisioning_key_payload"]
        [::core::mem::size_of::<fscrypt_provisioning_key_payload>() - 8usize];
    ["Alignment of fscrypt_provisioning_key_payload"]
        [::core::mem::align_of::<fscrypt_provisioning_key_payload>() - 4usize];
    ["Offset of field: fscrypt_provisioning_key_payload::type_"]
        [::core::mem::offset_of!(fscrypt_provisioning_key_payload, type_) - 0usize];
    ["Offset of field: fscrypt_provisioning_key_payload::flags"]
        [::core::mem::offset_of!(fscrypt_provisioning_key_payload, flags) - 4usize];
    ["Offset of field: fscrypt_provisioning_key_payload::raw"]
        [::core::mem::offset_of!(fscrypt_provisioning_key_payload, raw) - 8usize];
};
#[repr(C)]
pub struct fscrypt_add_key_arg {
    pub key_spec: fscrypt_key_specifier,
    pub raw_size: __u32,
    pub key_id: __u32,
    pub flags: __u32,
    pub __reserved: [__u32; 7usize],
    pub raw: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_add_key_arg"][::core::mem::size_of::<fscrypt_add_key_arg>() - 80usize];
    ["Alignment of fscrypt_add_key_arg"][::core::mem::align_of::<fscrypt_add_key_arg>() - 4usize];
    ["Offset of field: fscrypt_add_key_arg::key_spec"]
        [::core::mem::offset_of!(fscrypt_add_key_arg, key_spec) - 0usize];
    ["Offset of field: fscrypt_add_key_arg::raw_size"]
        [::core::mem::offset_of!(fscrypt_add_key_arg, raw_size) - 40usize];
    ["Offset of field: fscrypt_add_key_arg::key_id"]
        [::core::mem::offset_of!(fscrypt_add_key_arg, key_id) - 44usize];
    ["Offset of field: fscrypt_add_key_arg::flags"]
        [::core::mem::offset_of!(fscrypt_add_key_arg, flags) - 48usize];
    ["Offset of field: fscrypt_add_key_arg::__reserved"]
        [::core::mem::offset_of!(fscrypt_add_key_arg, __reserved) - 52usize];
    ["Offset of field: fscrypt_add_key_arg::raw"]
        [::core::mem::offset_of!(fscrypt_add_key_arg, raw) - 80usize];
};
impl Default for fscrypt_add_key_arg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fscrypt_remove_key_arg {
    pub key_spec: fscrypt_key_specifier,
    pub removal_status_flags: __u32,
    pub __reserved: [__u32; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_remove_key_arg"][::core::mem::size_of::<fscrypt_remove_key_arg>() - 64usize];
    ["Alignment of fscrypt_remove_key_arg"]
        [::core::mem::align_of::<fscrypt_remove_key_arg>() - 4usize];
    ["Offset of field: fscrypt_remove_key_arg::key_spec"]
        [::core::mem::offset_of!(fscrypt_remove_key_arg, key_spec) - 0usize];
    ["Offset of field: fscrypt_remove_key_arg::removal_status_flags"]
        [::core::mem::offset_of!(fscrypt_remove_key_arg, removal_status_flags) - 40usize];
    ["Offset of field: fscrypt_remove_key_arg::__reserved"]
        [::core::mem::offset_of!(fscrypt_remove_key_arg, __reserved) - 44usize];
};
impl Default for fscrypt_remove_key_arg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fscrypt_get_key_status_arg {
    pub key_spec: fscrypt_key_specifier,
    pub __reserved: [__u32; 6usize],
    pub status: __u32,
    pub status_flags: __u32,
    pub user_count: __u32,
    pub __out_reserved: [__u32; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fscrypt_get_key_status_arg"]
        [::core::mem::size_of::<fscrypt_get_key_status_arg>() - 128usize];
    ["Alignment of fscrypt_get_key_status_arg"]
        [::core::mem::align_of::<fscrypt_get_key_status_arg>() - 4usize];
    ["Offset of field: fscrypt_get_key_status_arg::key_spec"]
        [::core::mem::offset_of!(fscrypt_get_key_status_arg, key_spec) - 0usize];
    ["Offset of field: fscrypt_get_key_status_arg::__reserved"]
        [::core::mem::offset_of!(fscrypt_get_key_status_arg, __reserved) - 40usize];
    ["Offset of field: fscrypt_get_key_status_arg::status"]
        [::core::mem::offset_of!(fscrypt_get_key_status_arg, status) - 64usize];
    ["Offset of field: fscrypt_get_key_status_arg::status_flags"]
        [::core::mem::offset_of!(fscrypt_get_key_status_arg, status_flags) - 68usize];
    ["Offset of field: fscrypt_get_key_status_arg::user_count"]
        [::core::mem::offset_of!(fscrypt_get_key_status_arg, user_count) - 72usize];
    ["Offset of field: fscrypt_get_key_status_arg::__out_reserved"]
        [::core::mem::offset_of!(fscrypt_get_key_status_arg, __out_reserved) - 76usize];
};
impl Default for fscrypt_get_key_status_arg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const fsconfig_command_FSCONFIG_SET_FLAG: fsconfig_command = 0;
pub const fsconfig_command_FSCONFIG_SET_STRING: fsconfig_command = 1;
pub const fsconfig_command_FSCONFIG_SET_BINARY: fsconfig_command = 2;
pub const fsconfig_command_FSCONFIG_SET_PATH: fsconfig_command = 3;
pub const fsconfig_command_FSCONFIG_SET_PATH_EMPTY: fsconfig_command = 4;
pub const fsconfig_command_FSCONFIG_SET_FD: fsconfig_command = 5;
pub const fsconfig_command_FSCONFIG_CMD_CREATE: fsconfig_command = 6;
pub const fsconfig_command_FSCONFIG_CMD_RECONFIGURE: fsconfig_command = 7;
pub const fsconfig_command_FSCONFIG_CMD_CREATE_EXCL: fsconfig_command = 8;
pub type fsconfig_command = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mount_attr {
    pub attr_set: __u64,
    pub attr_clr: __u64,
    pub propagation: __u64,
    pub userns_fd: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mount_attr"][::core::mem::size_of::<mount_attr>() - 32usize];
    ["Alignment of mount_attr"][::core::mem::align_of::<mount_attr>() - 8usize];
    ["Offset of field: mount_attr::attr_set"]
        [::core::mem::offset_of!(mount_attr, attr_set) - 0usize];
    ["Offset of field: mount_attr::attr_clr"]
        [::core::mem::offset_of!(mount_attr, attr_clr) - 8usize];
    ["Offset of field: mount_attr::propagation"]
        [::core::mem::offset_of!(mount_attr, propagation) - 16usize];
    ["Offset of field: mount_attr::userns_fd"]
        [::core::mem::offset_of!(mount_attr, userns_fd) - 24usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct statmount {
    pub size: __u32,
    pub mnt_opts: __u32,
    pub mask: __u64,
    pub sb_dev_major: __u32,
    pub sb_dev_minor: __u32,
    pub sb_magic: __u64,
    pub sb_flags: __u32,
    pub fs_type: __u32,
    pub mnt_id: __u64,
    pub mnt_parent_id: __u64,
    pub mnt_id_old: __u32,
    pub mnt_parent_id_old: __u32,
    pub mnt_attr: __u64,
    pub mnt_propagation: __u64,
    pub mnt_peer_group: __u64,
    pub mnt_master: __u64,
    pub propagate_from: __u64,
    pub mnt_root: __u32,
    pub mnt_point: __u32,
    pub mnt_ns_id: __u64,
    pub fs_subtype: __u32,
    pub sb_source: __u32,
    pub opt_num: __u32,
    pub opt_array: __u32,
    pub opt_sec_num: __u32,
    pub opt_sec_array: __u32,
    pub supported_mask: __u64,
    pub mnt_uidmap_num: __u32,
    pub mnt_uidmap: __u32,
    pub mnt_gidmap_num: __u32,
    pub mnt_gidmap: __u32,
    pub __spare2: [__u64; 43usize],
    pub str_: __IncompleteArrayField<::core::ffi::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of statmount"][::core::mem::size_of::<statmount>() - 512usize];
    ["Alignment of statmount"][::core::mem::align_of::<statmount>() - 8usize];
    ["Offset of field: statmount::size"][::core::mem::offset_of!(statmount, size) - 0usize];
    ["Offset of field: statmount::mnt_opts"][::core::mem::offset_of!(statmount, mnt_opts) - 4usize];
    ["Offset of field: statmount::mask"][::core::mem::offset_of!(statmount, mask) - 8usize];
    ["Offset of field: statmount::sb_dev_major"]
        [::core::mem::offset_of!(statmount, sb_dev_major) - 16usize];
    ["Offset of field: statmount::sb_dev_minor"]
        [::core::mem::offset_of!(statmount, sb_dev_minor) - 20usize];
    ["Offset of field: statmount::sb_magic"]
        [::core::mem::offset_of!(statmount, sb_magic) - 24usize];
    ["Offset of field: statmount::sb_flags"]
        [::core::mem::offset_of!(statmount, sb_flags) - 32usize];
    ["Offset of field: statmount::fs_type"][::core::mem::offset_of!(statmount, fs_type) - 36usize];
    ["Offset of field: statmount::mnt_id"][::core::mem::offset_of!(statmount, mnt_id) - 40usize];
    ["Offset of field: statmount::mnt_parent_id"]
        [::core::mem::offset_of!(statmount, mnt_parent_id) - 48usize];
    ["Offset of field: statmount::mnt_id_old"]
        [::core::mem::offset_of!(statmount, mnt_id_old) - 56usize];
    ["Offset of field: statmount::mnt_parent_id_old"]
        [::core::mem::offset_of!(statmount, mnt_parent_id_old) - 60usize];
    ["Offset of field: statmount::mnt_attr"]
        [::core::mem::offset_of!(statmount, mnt_attr) - 64usize];
    ["Offset of field: statmount::mnt_propagation"]
        [::core::mem::offset_of!(statmount, mnt_propagation) - 72usize];
    ["Offset of field: statmount::mnt_peer_group"]
        [::core::mem::offset_of!(statmount, mnt_peer_group) - 80usize];
    ["Offset of field: statmount::mnt_master"]
        [::core::mem::offset_of!(statmount, mnt_master) - 88usize];
    ["Offset of field: statmount::propagate_from"]
        [::core::mem::offset_of!(statmount, propagate_from) - 96usize];
    ["Offset of field: statmount::mnt_root"]
        [::core::mem::offset_of!(statmount, mnt_root) - 104usize];
    ["Offset of field: statmount::mnt_point"]
        [::core::mem::offset_of!(statmount, mnt_point) - 108usize];
    ["Offset of field: statmount::mnt_ns_id"]
        [::core::mem::offset_of!(statmount, mnt_ns_id) - 112usize];
    ["Offset of field: statmount::fs_subtype"]
        [::core::mem::offset_of!(statmount, fs_subtype) - 120usize];
    ["Offset of field: statmount::sb_source"]
        [::core::mem::offset_of!(statmount, sb_source) - 124usize];
    ["Offset of field: statmount::opt_num"][::core::mem::offset_of!(statmount, opt_num) - 128usize];
    ["Offset of field: statmount::opt_array"]
        [::core::mem::offset_of!(statmount, opt_array) - 132usize];
    ["Offset of field: statmount::opt_sec_num"]
        [::core::mem::offset_of!(statmount, opt_sec_num) - 136usize];
    ["Offset of field: statmount::opt_sec_array"]
        [::core::mem::offset_of!(statmount, opt_sec_array) - 140usize];
    ["Offset of field: statmount::supported_mask"]
        [::core::mem::offset_of!(statmount, supported_mask) - 144usize];
    ["Offset of field: statmount::mnt_uidmap_num"]
        [::core::mem::offset_of!(statmount, mnt_uidmap_num) - 152usize];
    ["Offset of field: statmount::mnt_uidmap"]
        [::core::mem::offset_of!(statmount, mnt_uidmap) - 156usize];
    ["Offset of field: statmount::mnt_gidmap_num"]
        [::core::mem::offset_of!(statmount, mnt_gidmap_num) - 160usize];
    ["Offset of field: statmount::mnt_gidmap"]
        [::core::mem::offset_of!(statmount, mnt_gidmap) - 164usize];
    ["Offset of field: statmount::__spare2"]
        [::core::mem::offset_of!(statmount, __spare2) - 168usize];
    ["Offset of field: statmount::str_"][::core::mem::offset_of!(statmount, str_) - 512usize];
};
impl Default for statmount {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mnt_id_req {
    pub size: __u32,
    pub mnt_ns_fd: __u32,
    pub mnt_id: __u64,
    pub param: __u64,
    pub mnt_ns_id: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mnt_id_req"][::core::mem::size_of::<mnt_id_req>() - 32usize];
    ["Alignment of mnt_id_req"][::core::mem::align_of::<mnt_id_req>() - 8usize];
    ["Offset of field: mnt_id_req::size"][::core::mem::offset_of!(mnt_id_req, size) - 0usize];
    ["Offset of field: mnt_id_req::mnt_ns_fd"]
        [::core::mem::offset_of!(mnt_id_req, mnt_ns_fd) - 4usize];
    ["Offset of field: mnt_id_req::mnt_id"][::core::mem::offset_of!(mnt_id_req, mnt_id) - 8usize];
    ["Offset of field: mnt_id_req::param"][::core::mem::offset_of!(mnt_id_req, param) - 16usize];
    ["Offset of field: mnt_id_req::mnt_ns_id"]
        [::core::mem::offset_of!(mnt_id_req, mnt_ns_id) - 24usize];
};
pub const procfs_ino_PROCFS_ROOT_INO: procfs_ino = 1;
pub type procfs_ino = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct file_clone_range {
    pub src_fd: __s64,
    pub src_offset: __u64,
    pub src_length: __u64,
    pub dest_offset: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of file_clone_range"][::core::mem::size_of::<file_clone_range>() - 32usize];
    ["Alignment of file_clone_range"][::core::mem::align_of::<file_clone_range>() - 8usize];
    ["Offset of field: file_clone_range::src_fd"]
        [::core::mem::offset_of!(file_clone_range, src_fd) - 0usize];
    ["Offset of field: file_clone_range::src_offset"]
        [::core::mem::offset_of!(file_clone_range, src_offset) - 8usize];
    ["Offset of field: file_clone_range::src_length"]
        [::core::mem::offset_of!(file_clone_range, src_length) - 16usize];
    ["Offset of field: file_clone_range::dest_offset"]
        [::core::mem::offset_of!(file_clone_range, dest_offset) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fstrim_range {
    pub start: __u64,
    pub len: __u64,
    pub minlen: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fstrim_range"][::core::mem::size_of::<fstrim_range>() - 24usize];
    ["Alignment of fstrim_range"][::core::mem::align_of::<fstrim_range>() - 8usize];
    ["Offset of field: fstrim_range::start"][::core::mem::offset_of!(fstrim_range, start) - 0usize];
    ["Offset of field: fstrim_range::len"][::core::mem::offset_of!(fstrim_range, len) - 8usize];
    ["Offset of field: fstrim_range::minlen"]
        [::core::mem::offset_of!(fstrim_range, minlen) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fsuuid2 {
    pub len: __u8,
    pub uuid: [__u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fsuuid2"][::core::mem::size_of::<fsuuid2>() - 17usize];
    ["Alignment of fsuuid2"][::core::mem::align_of::<fsuuid2>() - 1usize];
    ["Offset of field: fsuuid2::len"][::core::mem::offset_of!(fsuuid2, len) - 0usize];
    ["Offset of field: fsuuid2::uuid"][::core::mem::offset_of!(fsuuid2, uuid) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fs_sysfs_path {
    pub len: __u8,
    pub name: [__u8; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fs_sysfs_path"][::core::mem::size_of::<fs_sysfs_path>() - 129usize];
    ["Alignment of fs_sysfs_path"][::core::mem::align_of::<fs_sysfs_path>() - 1usize];
    ["Offset of field: fs_sysfs_path::len"][::core::mem::offset_of!(fs_sysfs_path, len) - 0usize];
    ["Offset of field: fs_sysfs_path::name"][::core::mem::offset_of!(fs_sysfs_path, name) - 1usize];
};
impl Default for fs_sysfs_path {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct logical_block_metadata_cap {
    pub lbmd_flags: __u32,
    pub lbmd_interval: __u16,
    pub lbmd_size: __u8,
    pub lbmd_opaque_size: __u8,
    pub lbmd_opaque_offset: __u8,
    pub lbmd_pi_size: __u8,
    pub lbmd_pi_offset: __u8,
    pub lbmd_guard_tag_type: __u8,
    pub lbmd_app_tag_size: __u8,
    pub lbmd_ref_tag_size: __u8,
    pub lbmd_storage_tag_size: __u8,
    pub pad: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of logical_block_metadata_cap"]
        [::core::mem::size_of::<logical_block_metadata_cap>() - 16usize];
    ["Alignment of logical_block_metadata_cap"]
        [::core::mem::align_of::<logical_block_metadata_cap>() - 4usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_flags"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_flags) - 0usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_interval"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_interval) - 4usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_size"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_size) - 6usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_opaque_size"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_opaque_size) - 7usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_opaque_offset"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_opaque_offset) - 8usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_pi_size"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_pi_size) - 9usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_pi_offset"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_pi_offset) - 10usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_guard_tag_type"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_guard_tag_type) - 11usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_app_tag_size"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_app_tag_size) - 12usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_ref_tag_size"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_ref_tag_size) - 13usize];
    ["Offset of field: logical_block_metadata_cap::lbmd_storage_tag_size"]
        [::core::mem::offset_of!(logical_block_metadata_cap, lbmd_storage_tag_size) - 14usize];
    ["Offset of field: logical_block_metadata_cap::pad"]
        [::core::mem::offset_of!(logical_block_metadata_cap, pad) - 15usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct file_dedupe_range_info {
    pub dest_fd: __s64,
    pub dest_offset: __u64,
    pub bytes_deduped: __u64,
    pub status: __s32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of file_dedupe_range_info"][::core::mem::size_of::<file_dedupe_range_info>() - 32usize];
    ["Alignment of file_dedupe_range_info"]
        [::core::mem::align_of::<file_dedupe_range_info>() - 8usize];
    ["Offset of field: file_dedupe_range_info::dest_fd"]
        [::core::mem::offset_of!(file_dedupe_range_info, dest_fd) - 0usize];
    ["Offset of field: file_dedupe_range_info::dest_offset"]
        [::core::mem::offset_of!(file_dedupe_range_info, dest_offset) - 8usize];
    ["Offset of field: file_dedupe_range_info::bytes_deduped"]
        [::core::mem::offset_of!(file_dedupe_range_info, bytes_deduped) - 16usize];
    ["Offset of field: file_dedupe_range_info::status"]
        [::core::mem::offset_of!(file_dedupe_range_info, status) - 24usize];
    ["Offset of field: file_dedupe_range_info::reserved"]
        [::core::mem::offset_of!(file_dedupe_range_info, reserved) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct file_dedupe_range {
    pub src_offset: __u64,
    pub src_length: __u64,
    pub dest_count: __u16,
    pub reserved1: __u16,
    pub reserved2: __u32,
    pub info: __IncompleteArrayField<file_dedupe_range_info>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of file_dedupe_range"][::core::mem::size_of::<file_dedupe_range>() - 24usize];
    ["Alignment of file_dedupe_range"][::core::mem::align_of::<file_dedupe_range>() - 8usize];
    ["Offset of field: file_dedupe_range::src_offset"]
        [::core::mem::offset_of!(file_dedupe_range, src_offset) - 0usize];
    ["Offset of field: file_dedupe_range::src_length"]
        [::core::mem::offset_of!(file_dedupe_range, src_length) - 8usize];
    ["Offset of field: file_dedupe_range::dest_count"]
        [::core::mem::offset_of!(file_dedupe_range, dest_count) - 16usize];
    ["Offset of field: file_dedupe_range::reserved1"]
        [::core::mem::offset_of!(file_dedupe_range, reserved1) - 18usize];
    ["Offset of field: file_dedupe_range::reserved2"]
        [::core::mem::offset_of!(file_dedupe_range, reserved2) - 20usize];
    ["Offset of field: file_dedupe_range::info"]
        [::core::mem::offset_of!(file_dedupe_range, info) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct files_stat_struct {
    pub nr_files: ::core::ffi::c_ulong,
    pub nr_free_files: ::core::ffi::c_ulong,
    pub max_files: ::core::ffi::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of files_stat_struct"][::core::mem::size_of::<files_stat_struct>() - 24usize];
    ["Alignment of files_stat_struct"][::core::mem::align_of::<files_stat_struct>() - 8usize];
    ["Offset of field: files_stat_struct::nr_files"]
        [::core::mem::offset_of!(files_stat_struct, nr_files) - 0usize];
    ["Offset of field: files_stat_struct::nr_free_files"]
        [::core::mem::offset_of!(files_stat_struct, nr_free_files) - 8usize];
    ["Offset of field: files_stat_struct::max_files"]
        [::core::mem::offset_of!(files_stat_struct, max_files) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct inodes_stat_t {
    pub nr_inodes: ::core::ffi::c_long,
    pub nr_unused: ::core::ffi::c_long,
    pub dummy: [::core::ffi::c_long; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of inodes_stat_t"][::core::mem::size_of::<inodes_stat_t>() - 56usize];
    ["Alignment of inodes_stat_t"][::core::mem::align_of::<inodes_stat_t>() - 8usize];
    ["Offset of field: inodes_stat_t::nr_inodes"]
        [::core::mem::offset_of!(inodes_stat_t, nr_inodes) - 0usize];
    ["Offset of field: inodes_stat_t::nr_unused"]
        [::core::mem::offset_of!(inodes_stat_t, nr_unused) - 8usize];
    ["Offset of field: inodes_stat_t::dummy"]
        [::core::mem::offset_of!(inodes_stat_t, dummy) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fsxattr {
    pub fsx_xflags: __u32,
    pub fsx_extsize: __u32,
    pub fsx_nextents: __u32,
    pub fsx_projid: __u32,
    pub fsx_cowextsize: __u32,
    pub fsx_pad: [::core::ffi::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fsxattr"][::core::mem::size_of::<fsxattr>() - 28usize];
    ["Alignment of fsxattr"][::core::mem::align_of::<fsxattr>() - 4usize];
    ["Offset of field: fsxattr::fsx_xflags"][::core::mem::offset_of!(fsxattr, fsx_xflags) - 0usize];
    ["Offset of field: fsxattr::fsx_extsize"]
        [::core::mem::offset_of!(fsxattr, fsx_extsize) - 4usize];
    ["Offset of field: fsxattr::fsx_nextents"]
        [::core::mem::offset_of!(fsxattr, fsx_nextents) - 8usize];
    ["Offset of field: fsxattr::fsx_projid"]
        [::core::mem::offset_of!(fsxattr, fsx_projid) - 12usize];
    ["Offset of field: fsxattr::fsx_cowextsize"]
        [::core::mem::offset_of!(fsxattr, fsx_cowextsize) - 16usize];
    ["Offset of field: fsxattr::fsx_pad"][::core::mem::offset_of!(fsxattr, fsx_pad) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct file_attr {
    pub fa_xflags: __u64,
    pub fa_extsize: __u32,
    pub fa_nextents: __u32,
    pub fa_projid: __u32,
    pub fa_cowextsize: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of file_attr"][::core::mem::size_of::<file_attr>() - 24usize];
    ["Alignment of file_attr"][::core::mem::align_of::<file_attr>() - 8usize];
    ["Offset of field: file_attr::fa_xflags"]
        [::core::mem::offset_of!(file_attr, fa_xflags) - 0usize];
    ["Offset of field: file_attr::fa_extsize"]
        [::core::mem::offset_of!(file_attr, fa_extsize) - 8usize];
    ["Offset of field: file_attr::fa_nextents"]
        [::core::mem::offset_of!(file_attr, fa_nextents) - 12usize];
    ["Offset of field: file_attr::fa_projid"]
        [::core::mem::offset_of!(file_attr, fa_projid) - 16usize];
    ["Offset of field: file_attr::fa_cowextsize"]
        [::core::mem::offset_of!(file_attr, fa_cowextsize) - 20usize];
};
pub type __kernel_rwf_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct page_region {
    pub start: __u64,
    pub end: __u64,
    pub categories: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of page_region"][::core::mem::size_of::<page_region>() - 24usize];
    ["Alignment of page_region"][::core::mem::align_of::<page_region>() - 8usize];
    ["Offset of field: page_region::start"][::core::mem::offset_of!(page_region, start) - 0usize];
    ["Offset of field: page_region::end"][::core::mem::offset_of!(page_region, end) - 8usize];
    ["Offset of field: page_region::categories"]
        [::core::mem::offset_of!(page_region, categories) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct pm_scan_arg {
    pub size: __u64,
    pub flags: __u64,
    pub start: __u64,
    pub end: __u64,
    pub walk_end: __u64,
    pub vec: __u64,
    pub vec_len: __u64,
    pub max_pages: __u64,
    pub category_inverted: __u64,
    pub category_mask: __u64,
    pub category_anyof_mask: __u64,
    pub return_mask: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_scan_arg"][::core::mem::size_of::<pm_scan_arg>() - 96usize];
    ["Alignment of pm_scan_arg"][::core::mem::align_of::<pm_scan_arg>() - 8usize];
    ["Offset of field: pm_scan_arg::size"][::core::mem::offset_of!(pm_scan_arg, size) - 0usize];
    ["Offset of field: pm_scan_arg::flags"][::core::mem::offset_of!(pm_scan_arg, flags) - 8usize];
    ["Offset of field: pm_scan_arg::start"][::core::mem::offset_of!(pm_scan_arg, start) - 16usize];
    ["Offset of field: pm_scan_arg::end"][::core::mem::offset_of!(pm_scan_arg, end) - 24usize];
    ["Offset of field: pm_scan_arg::walk_end"]
        [::core::mem::offset_of!(pm_scan_arg, walk_end) - 32usize];
    ["Offset of field: pm_scan_arg::vec"][::core::mem::offset_of!(pm_scan_arg, vec) - 40usize];
    ["Offset of field: pm_scan_arg::vec_len"]
        [::core::mem::offset_of!(pm_scan_arg, vec_len) - 48usize];
    ["Offset of field: pm_scan_arg::max_pages"]
        [::core::mem::offset_of!(pm_scan_arg, max_pages) - 56usize];
    ["Offset of field: pm_scan_arg::category_inverted"]
        [::core::mem::offset_of!(pm_scan_arg, category_inverted) - 64usize];
    ["Offset of field: pm_scan_arg::category_mask"]
        [::core::mem::offset_of!(pm_scan_arg, category_mask) - 72usize];
    ["Offset of field: pm_scan_arg::category_anyof_mask"]
        [::core::mem::offset_of!(pm_scan_arg, category_anyof_mask) - 80usize];
    ["Offset of field: pm_scan_arg::return_mask"]
        [::core::mem::offset_of!(pm_scan_arg, return_mask) - 88usize];
};
pub const procmap_query_flags_PROCMAP_QUERY_VMA_READABLE: procmap_query_flags = 1;
pub const procmap_query_flags_PROCMAP_QUERY_VMA_WRITABLE: procmap_query_flags = 2;
pub const procmap_query_flags_PROCMAP_QUERY_VMA_EXECUTABLE: procmap_query_flags = 4;
pub const procmap_query_flags_PROCMAP_QUERY_VMA_SHARED: procmap_query_flags = 8;
pub const procmap_query_flags_PROCMAP_QUERY_COVERING_OR_NEXT_VMA: procmap_query_flags = 16;
pub const procmap_query_flags_PROCMAP_QUERY_FILE_BACKED_VMA: procmap_query_flags = 32;
pub type procmap_query_flags = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct procmap_query {
    pub size: __u64,
    pub query_flags: __u64,
    pub query_addr: __u64,
    pub vma_start: __u64,
    pub vma_end: __u64,
    pub vma_flags: __u64,
    pub vma_page_size: __u64,
    pub vma_offset: __u64,
    pub inode: __u64,
    pub dev_major: __u32,
    pub dev_minor: __u32,
    pub vma_name_size: __u32,
    pub build_id_size: __u32,
    pub vma_name_addr: __u64,
    pub build_id_addr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of procmap_query"][::core::mem::size_of::<procmap_query>() - 104usize];
    ["Alignment of procmap_query"][::core::mem::align_of::<procmap_query>() - 8usize];
    ["Offset of field: procmap_query::size"][::core::mem::offset_of!(procmap_query, size) - 0usize];
    ["Offset of field: procmap_query::query_flags"]
        [::core::mem::offset_of!(procmap_query, query_flags) - 8usize];
    ["Offset of field: procmap_query::query_addr"]
        [::core::mem::offset_of!(procmap_query, query_addr) - 16usize];
    ["Offset of field: procmap_query::vma_start"]
        [::core::mem::offset_of!(procmap_query, vma_start) - 24usize];
    ["Offset of field: procmap_query::vma_end"]
        [::core::mem::offset_of!(procmap_query, vma_end) - 32usize];
    ["Offset of field: procmap_query::vma_flags"]
        [::core::mem::offset_of!(procmap_query, vma_flags) - 40usize];
    ["Offset of field: procmap_query::vma_page_size"]
        [::core::mem::offset_of!(procmap_query, vma_page_size) - 48usize];
    ["Offset of field: procmap_query::vma_offset"]
        [::core::mem::offset_of!(procmap_query, vma_offset) - 56usize];
    ["Offset of field: procmap_query::inode"]
        [::core::mem::offset_of!(procmap_query, inode) - 64usize];
    ["Offset of field: procmap_query::dev_major"]
        [::core::mem::offset_of!(procmap_query, dev_major) - 72usize];
    ["Offset of field: procmap_query::dev_minor"]
        [::core::mem::offset_of!(procmap_query, dev_minor) - 76usize];
    ["Offset of field: procmap_query::vma_name_size"]
        [::core::mem::offset_of!(procmap_query, vma_name_size) - 80usize];
    ["Offset of field: procmap_query::build_id_size"]
        [::core::mem::offset_of!(procmap_query, build_id_size) - 84usize];
    ["Offset of field: procmap_query::vma_name_addr"]
        [::core::mem::offset_of!(procmap_query, vma_name_addr) - 88usize];
    ["Offset of field: procmap_query::build_id_addr"]
        [::core::mem::offset_of!(procmap_query, build_id_addr) - 96usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_timespec {
    pub tv_sec: __kernel_time64_t,
    pub tv_nsec: ::core::ffi::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_timespec"][::core::mem::size_of::<__kernel_timespec>() - 16usize];
    ["Alignment of __kernel_timespec"][::core::mem::align_of::<__kernel_timespec>() - 8usize];
    ["Offset of field: __kernel_timespec::tv_sec"]
        [::core::mem::offset_of!(__kernel_timespec, tv_sec) - 0usize];
    ["Offset of field: __kernel_timespec::tv_nsec"]
        [::core::mem::offset_of!(__kernel_timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_itimerspec {
    pub it_interval: __kernel_timespec,
    pub it_value: __kernel_timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_itimerspec"][::core::mem::size_of::<__kernel_itimerspec>() - 32usize];
    ["Alignment of __kernel_itimerspec"][::core::mem::align_of::<__kernel_itimerspec>() - 8usize];
    ["Offset of field: __kernel_itimerspec::it_interval"]
        [::core::mem::offset_of!(__kernel_itimerspec, it_interval) - 0usize];
    ["Offset of field: __kernel_itimerspec::it_value"]
        [::core::mem::offset_of!(__kernel_itimerspec, it_value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_old_timeval {
    pub tv_sec: __kernel_long_t,
    pub tv_usec: __kernel_long_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_old_timeval"][::core::mem::size_of::<__kernel_old_timeval>() - 16usize];
    ["Alignment of __kernel_old_timeval"][::core::mem::align_of::<__kernel_old_timeval>() - 8usize];
    ["Offset of field: __kernel_old_timeval::tv_sec"]
        [::core::mem::offset_of!(__kernel_old_timeval, tv_sec) - 0usize];
    ["Offset of field: __kernel_old_timeval::tv_usec"]
        [::core::mem::offset_of!(__kernel_old_timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_old_timespec {
    pub tv_sec: __kernel_old_time_t,
    pub tv_nsec: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_old_timespec"][::core::mem::size_of::<__kernel_old_timespec>() - 16usize];
    ["Alignment of __kernel_old_timespec"]
        [::core::mem::align_of::<__kernel_old_timespec>() - 8usize];
    ["Offset of field: __kernel_old_timespec::tv_sec"]
        [::core::mem::offset_of!(__kernel_old_timespec, tv_sec) - 0usize];
    ["Offset of field: __kernel_old_timespec::tv_nsec"]
        [::core::mem::offset_of!(__kernel_old_timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_old_itimerval {
    pub it_interval: __kernel_old_timeval,
    pub it_value: __kernel_old_timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_old_itimerval"][::core::mem::size_of::<__kernel_old_itimerval>() - 32usize];
    ["Alignment of __kernel_old_itimerval"]
        [::core::mem::align_of::<__kernel_old_itimerval>() - 8usize];
    ["Offset of field: __kernel_old_itimerval::it_interval"]
        [::core::mem::offset_of!(__kernel_old_itimerval, it_interval) - 0usize];
    ["Offset of field: __kernel_old_itimerval::it_value"]
        [::core::mem::offset_of!(__kernel_old_itimerval, it_value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_sock_timeval {
    pub tv_sec: __s64,
    pub tv_usec: __s64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_sock_timeval"][::core::mem::size_of::<__kernel_sock_timeval>() - 16usize];
    ["Alignment of __kernel_sock_timeval"]
        [::core::mem::align_of::<__kernel_sock_timeval>() - 8usize];
    ["Offset of field: __kernel_sock_timeval::tv_sec"]
        [::core::mem::offset_of!(__kernel_sock_timeval, tv_sec) - 0usize];
    ["Offset of field: __kernel_sock_timeval::tv_usec"]
        [::core::mem::offset_of!(__kernel_sock_timeval, tv_usec) - 8usize];
};
#[repr(C)]
pub struct io_uring_sqe {
    pub opcode: __u8,
    pub flags: __u8,
    pub ioprio: __u16,
    pub fd: __s32,
    pub __bindgen_anon_1: io_uring_sqe__bindgen_ty_1,
    pub __bindgen_anon_2: io_uring_sqe__bindgen_ty_2,
    pub len: __u32,
    pub __bindgen_anon_3: io_uring_sqe__bindgen_ty_3,
    pub user_data: __u64,
    pub __bindgen_anon_4: io_uring_sqe__bindgen_ty_4,
    pub personality: __u16,
    pub __bindgen_anon_5: io_uring_sqe__bindgen_ty_5,
    pub __bindgen_anon_6: io_uring_sqe__bindgen_ty_6,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_uring_sqe__bindgen_ty_1 {
    pub off: __u64,
    pub addr2: __u64,
    pub __bindgen_anon_1: io_uring_sqe__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sqe__bindgen_ty_1__bindgen_ty_1 {
    pub cmd_op: __u32,
    pub __pad1: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_1__bindgen_ty_1::cmd_op"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_1__bindgen_ty_1, cmd_op) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_1__bindgen_ty_1::__pad1"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_1__bindgen_ty_1, __pad1) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_1>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_1>() - 8usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_1::off"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_1, off) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_1::addr2"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_1, addr2) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_uring_sqe__bindgen_ty_2 {
    pub addr: __u64,
    pub splice_off_in: __u64,
    pub __bindgen_anon_1: io_uring_sqe__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sqe__bindgen_ty_2__bindgen_ty_1 {
    pub level: __u32,
    pub optname: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_2__bindgen_ty_1>() - 4usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_2__bindgen_ty_1::level"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_2__bindgen_ty_1, level) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_2__bindgen_ty_1::optname"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_2__bindgen_ty_1, optname) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_2"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_2>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_2"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_2>() - 8usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_2::addr"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_2, addr) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_2::splice_off_in"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_2, splice_off_in) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_uring_sqe__bindgen_ty_3 {
    pub rw_flags: __u32,
    pub fsync_flags: __u32,
    pub poll_events: __u16,
    pub poll32_events: __u32,
    pub sync_range_flags: __u32,
    pub msg_flags: __u32,
    pub timeout_flags: __u32,
    pub accept_flags: __u32,
    pub cancel_flags: __u32,
    pub open_flags: __u32,
    pub statx_flags: __u32,
    pub fadvise_advice: __u32,
    pub splice_flags: __u32,
    pub rename_flags: __u32,
    pub unlink_flags: __u32,
    pub hardlink_flags: __u32,
    pub xattr_flags: __u32,
    pub msg_ring_flags: __u32,
    pub uring_cmd_flags: __u32,
    pub waitid_flags: __u32,
    pub futex_flags: __u32,
    pub install_fd_flags: __u32,
    pub nop_flags: __u32,
    pub pipe_flags: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_3"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_3>() - 4usize];
    ["Alignment of io_uring_sqe__bindgen_ty_3"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_3>() - 4usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::rw_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, rw_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::fsync_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, fsync_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::poll_events"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, poll_events) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::poll32_events"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, poll32_events) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::sync_range_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, sync_range_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::msg_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, msg_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::timeout_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, timeout_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::accept_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, accept_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::cancel_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, cancel_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::open_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, open_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::statx_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, statx_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::fadvise_advice"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, fadvise_advice) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::splice_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, splice_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::rename_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, rename_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::unlink_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, unlink_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::hardlink_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, hardlink_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::xattr_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, xattr_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::msg_ring_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, msg_ring_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::uring_cmd_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, uring_cmd_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::waitid_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, waitid_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::futex_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, futex_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::install_fd_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, install_fd_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::nop_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, nop_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::pipe_flags"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_3, pipe_flags) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union io_uring_sqe__bindgen_ty_4 {
    pub buf_index: __u16,
    pub buf_group: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_4"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_4>() - 2usize];
    ["Alignment of io_uring_sqe__bindgen_ty_4"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_4>() - 1usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_4::buf_index"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_4, buf_index) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_4::buf_group"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_4, buf_group) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_4 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_uring_sqe__bindgen_ty_5 {
    pub splice_fd_in: __s32,
    pub file_index: __u32,
    pub zcrx_ifq_idx: __u32,
    pub optlen: __u32,
    pub __bindgen_anon_1: io_uring_sqe__bindgen_ty_5__bindgen_ty_1,
    pub __bindgen_anon_2: io_uring_sqe__bindgen_ty_5__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sqe__bindgen_ty_5__bindgen_ty_1 {
    pub addr_len: __u16,
    pub __pad3: [__u16; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_5__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_5__bindgen_ty_1>() - 4usize];
    ["Alignment of io_uring_sqe__bindgen_ty_5__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_5__bindgen_ty_1>() - 2usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5__bindgen_ty_1::addr_len"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_5__bindgen_ty_1, addr_len) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5__bindgen_ty_1::__pad3"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_5__bindgen_ty_1, __pad3) - 2usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sqe__bindgen_ty_5__bindgen_ty_2 {
    pub write_stream: __u8,
    pub __pad4: [__u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_5__bindgen_ty_2"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_5__bindgen_ty_2>() - 4usize];
    ["Alignment of io_uring_sqe__bindgen_ty_5__bindgen_ty_2"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_5__bindgen_ty_2>() - 1usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5__bindgen_ty_2::write_stream"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_5__bindgen_ty_2, write_stream) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5__bindgen_ty_2::__pad4"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_5__bindgen_ty_2, __pad4) - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_5"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_5>() - 4usize];
    ["Alignment of io_uring_sqe__bindgen_ty_5"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_5>() - 4usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5::splice_fd_in"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_5, splice_fd_in) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5::file_index"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_5, file_index) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5::zcrx_ifq_idx"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_5, zcrx_ifq_idx) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5::optlen"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_5, optlen) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_5 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct io_uring_sqe__bindgen_ty_6 {
    pub __bindgen_anon_1: __BindgenUnionField<io_uring_sqe__bindgen_ty_6__bindgen_ty_1>,
    pub __bindgen_anon_2: __BindgenUnionField<io_uring_sqe__bindgen_ty_6__bindgen_ty_2>,
    pub optval: __BindgenUnionField<__u64>,
    pub cmd: __BindgenUnionField<[__u8; 0usize]>,
    pub bindgen_union_field: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sqe__bindgen_ty_6__bindgen_ty_1 {
    pub addr3: __u64,
    pub __pad2: [__u64; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_6__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_6__bindgen_ty_1>() - 16usize];
    ["Alignment of io_uring_sqe__bindgen_ty_6__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_6__bindgen_ty_1>() - 8usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_6__bindgen_ty_1::addr3"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_6__bindgen_ty_1, addr3) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_6__bindgen_ty_1::__pad2"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_6__bindgen_ty_1, __pad2) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sqe__bindgen_ty_6__bindgen_ty_2 {
    pub attr_ptr: __u64,
    pub attr_type_mask: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_6__bindgen_ty_2"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_6__bindgen_ty_2>() - 16usize];
    ["Alignment of io_uring_sqe__bindgen_ty_6__bindgen_ty_2"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_6__bindgen_ty_2>() - 8usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_6__bindgen_ty_2::attr_ptr"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_6__bindgen_ty_2, attr_ptr) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_6__bindgen_ty_2::attr_type_mask"][::core::mem::offset_of!(
        io_uring_sqe__bindgen_ty_6__bindgen_ty_2,
        attr_type_mask
    ) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_6"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_6>() - 16usize];
    ["Alignment of io_uring_sqe__bindgen_ty_6"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_6>() - 8usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_6::optval"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_6, optval) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_6::cmd"]
        [::core::mem::offset_of!(io_uring_sqe__bindgen_ty_6, cmd) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_6 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe"][::core::mem::size_of::<io_uring_sqe>() - 64usize];
    ["Alignment of io_uring_sqe"][::core::mem::align_of::<io_uring_sqe>() - 8usize];
    ["Offset of field: io_uring_sqe::opcode"]
        [::core::mem::offset_of!(io_uring_sqe, opcode) - 0usize];
    ["Offset of field: io_uring_sqe::flags"][::core::mem::offset_of!(io_uring_sqe, flags) - 1usize];
    ["Offset of field: io_uring_sqe::ioprio"]
        [::core::mem::offset_of!(io_uring_sqe, ioprio) - 2usize];
    ["Offset of field: io_uring_sqe::fd"][::core::mem::offset_of!(io_uring_sqe, fd) - 4usize];
    ["Offset of field: io_uring_sqe::len"][::core::mem::offset_of!(io_uring_sqe, len) - 24usize];
    ["Offset of field: io_uring_sqe::user_data"]
        [::core::mem::offset_of!(io_uring_sqe, user_data) - 32usize];
    ["Offset of field: io_uring_sqe::personality"]
        [::core::mem::offset_of!(io_uring_sqe, personality) - 42usize];
};
impl Default for io_uring_sqe {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_attr_pi {
    pub flags: __u16,
    pub app_tag: __u16,
    pub len: __u32,
    pub addr: __u64,
    pub seed: __u64,
    pub rsvd: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_attr_pi"][::core::mem::size_of::<io_uring_attr_pi>() - 32usize];
    ["Alignment of io_uring_attr_pi"][::core::mem::align_of::<io_uring_attr_pi>() - 8usize];
    ["Offset of field: io_uring_attr_pi::flags"]
        [::core::mem::offset_of!(io_uring_attr_pi, flags) - 0usize];
    ["Offset of field: io_uring_attr_pi::app_tag"]
        [::core::mem::offset_of!(io_uring_attr_pi, app_tag) - 2usize];
    ["Offset of field: io_uring_attr_pi::len"]
        [::core::mem::offset_of!(io_uring_attr_pi, len) - 4usize];
    ["Offset of field: io_uring_attr_pi::addr"]
        [::core::mem::offset_of!(io_uring_attr_pi, addr) - 8usize];
    ["Offset of field: io_uring_attr_pi::seed"]
        [::core::mem::offset_of!(io_uring_attr_pi, seed) - 16usize];
    ["Offset of field: io_uring_attr_pi::rsvd"]
        [::core::mem::offset_of!(io_uring_attr_pi, rsvd) - 24usize];
};
pub const io_uring_sqe_flags_bit_IOSQE_FIXED_FILE_BIT: io_uring_sqe_flags_bit = 0;
pub const io_uring_sqe_flags_bit_IOSQE_IO_DRAIN_BIT: io_uring_sqe_flags_bit = 1;
pub const io_uring_sqe_flags_bit_IOSQE_IO_LINK_BIT: io_uring_sqe_flags_bit = 2;
pub const io_uring_sqe_flags_bit_IOSQE_IO_HARDLINK_BIT: io_uring_sqe_flags_bit = 3;
pub const io_uring_sqe_flags_bit_IOSQE_ASYNC_BIT: io_uring_sqe_flags_bit = 4;
pub const io_uring_sqe_flags_bit_IOSQE_BUFFER_SELECT_BIT: io_uring_sqe_flags_bit = 5;
pub const io_uring_sqe_flags_bit_IOSQE_CQE_SKIP_SUCCESS_BIT: io_uring_sqe_flags_bit = 6;
pub type io_uring_sqe_flags_bit = ::core::ffi::c_uint;
pub const io_uring_op_IORING_OP_NOP: io_uring_op = 0;
pub const io_uring_op_IORING_OP_READV: io_uring_op = 1;
pub const io_uring_op_IORING_OP_WRITEV: io_uring_op = 2;
pub const io_uring_op_IORING_OP_FSYNC: io_uring_op = 3;
pub const io_uring_op_IORING_OP_READ_FIXED: io_uring_op = 4;
pub const io_uring_op_IORING_OP_WRITE_FIXED: io_uring_op = 5;
pub const io_uring_op_IORING_OP_POLL_ADD: io_uring_op = 6;
pub const io_uring_op_IORING_OP_POLL_REMOVE: io_uring_op = 7;
pub const io_uring_op_IORING_OP_SYNC_FILE_RANGE: io_uring_op = 8;
pub const io_uring_op_IORING_OP_SENDMSG: io_uring_op = 9;
pub const io_uring_op_IORING_OP_RECVMSG: io_uring_op = 10;
pub const io_uring_op_IORING_OP_TIMEOUT: io_uring_op = 11;
pub const io_uring_op_IORING_OP_TIMEOUT_REMOVE: io_uring_op = 12;
pub const io_uring_op_IORING_OP_ACCEPT: io_uring_op = 13;
pub const io_uring_op_IORING_OP_ASYNC_CANCEL: io_uring_op = 14;
pub const io_uring_op_IORING_OP_LINK_TIMEOUT: io_uring_op = 15;
pub const io_uring_op_IORING_OP_CONNECT: io_uring_op = 16;
pub const io_uring_op_IORING_OP_FALLOCATE: io_uring_op = 17;
pub const io_uring_op_IORING_OP_OPENAT: io_uring_op = 18;
pub const io_uring_op_IORING_OP_CLOSE: io_uring_op = 19;
pub const io_uring_op_IORING_OP_FILES_UPDATE: io_uring_op = 20;
pub const io_uring_op_IORING_OP_STATX: io_uring_op = 21;
pub const io_uring_op_IORING_OP_READ: io_uring_op = 22;
pub const io_uring_op_IORING_OP_WRITE: io_uring_op = 23;
pub const io_uring_op_IORING_OP_FADVISE: io_uring_op = 24;
pub const io_uring_op_IORING_OP_MADVISE: io_uring_op = 25;
pub const io_uring_op_IORING_OP_SEND: io_uring_op = 26;
pub const io_uring_op_IORING_OP_RECV: io_uring_op = 27;
pub const io_uring_op_IORING_OP_OPENAT2: io_uring_op = 28;
pub const io_uring_op_IORING_OP_EPOLL_CTL: io_uring_op = 29;
pub const io_uring_op_IORING_OP_SPLICE: io_uring_op = 30;
pub const io_uring_op_IORING_OP_PROVIDE_BUFFERS: io_uring_op = 31;
pub const io_uring_op_IORING_OP_REMOVE_BUFFERS: io_uring_op = 32;
pub const io_uring_op_IORING_OP_TEE: io_uring_op = 33;
pub const io_uring_op_IORING_OP_SHUTDOWN: io_uring_op = 34;
pub const io_uring_op_IORING_OP_RENAMEAT: io_uring_op = 35;
pub const io_uring_op_IORING_OP_UNLINKAT: io_uring_op = 36;
pub const io_uring_op_IORING_OP_MKDIRAT: io_uring_op = 37;
pub const io_uring_op_IORING_OP_SYMLINKAT: io_uring_op = 38;
pub const io_uring_op_IORING_OP_LINKAT: io_uring_op = 39;
pub const io_uring_op_IORING_OP_MSG_RING: io_uring_op = 40;
pub const io_uring_op_IORING_OP_FSETXATTR: io_uring_op = 41;
pub const io_uring_op_IORING_OP_SETXATTR: io_uring_op = 42;
pub const io_uring_op_IORING_OP_FGETXATTR: io_uring_op = 43;
pub const io_uring_op_IORING_OP_GETXATTR: io_uring_op = 44;
pub const io_uring_op_IORING_OP_SOCKET: io_uring_op = 45;
pub const io_uring_op_IORING_OP_URING_CMD: io_uring_op = 46;
pub const io_uring_op_IORING_OP_SEND_ZC: io_uring_op = 47;
pub const io_uring_op_IORING_OP_SENDMSG_ZC: io_uring_op = 48;
pub const io_uring_op_IORING_OP_READ_MULTISHOT: io_uring_op = 49;
pub const io_uring_op_IORING_OP_WAITID: io_uring_op = 50;
pub const io_uring_op_IORING_OP_FUTEX_WAIT: io_uring_op = 51;
pub const io_uring_op_IORING_OP_FUTEX_WAKE: io_uring_op = 52;
pub const io_uring_op_IORING_OP_FUTEX_WAITV: io_uring_op = 53;
pub const io_uring_op_IORING_OP_FIXED_FD_INSTALL: io_uring_op = 54;
pub const io_uring_op_IORING_OP_FTRUNCATE: io_uring_op = 55;
pub const io_uring_op_IORING_OP_BIND: io_uring_op = 56;
pub const io_uring_op_IORING_OP_LISTEN: io_uring_op = 57;
pub const io_uring_op_IORING_OP_RECV_ZC: io_uring_op = 58;
pub const io_uring_op_IORING_OP_EPOLL_WAIT: io_uring_op = 59;
pub const io_uring_op_IORING_OP_READV_FIXED: io_uring_op = 60;
pub const io_uring_op_IORING_OP_WRITEV_FIXED: io_uring_op = 61;
pub const io_uring_op_IORING_OP_PIPE: io_uring_op = 62;
pub const io_uring_op_IORING_OP_NOP128: io_uring_op = 63;
pub const io_uring_op_IORING_OP_URING_CMD128: io_uring_op = 64;
pub const io_uring_op_IORING_OP_LAST: io_uring_op = 65;
pub type io_uring_op = ::core::ffi::c_uint;
pub const io_uring_msg_ring_flags_IORING_MSG_DATA: io_uring_msg_ring_flags = 0;
pub const io_uring_msg_ring_flags_IORING_MSG_SEND_FD: io_uring_msg_ring_flags = 1;
pub type io_uring_msg_ring_flags = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default)]
pub struct io_uring_cqe {
    pub user_data: __u64,
    pub res: __s32,
    pub flags: __u32,
    pub big_cqe: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_cqe"][::core::mem::size_of::<io_uring_cqe>() - 16usize];
    ["Alignment of io_uring_cqe"][::core::mem::align_of::<io_uring_cqe>() - 8usize];
    ["Offset of field: io_uring_cqe::user_data"]
        [::core::mem::offset_of!(io_uring_cqe, user_data) - 0usize];
    ["Offset of field: io_uring_cqe::res"][::core::mem::offset_of!(io_uring_cqe, res) - 8usize];
    ["Offset of field: io_uring_cqe::flags"]
        [::core::mem::offset_of!(io_uring_cqe, flags) - 12usize];
    ["Offset of field: io_uring_cqe::big_cqe"]
        [::core::mem::offset_of!(io_uring_cqe, big_cqe) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_sqring_offsets {
    pub head: __u32,
    pub tail: __u32,
    pub ring_mask: __u32,
    pub ring_entries: __u32,
    pub flags: __u32,
    pub dropped: __u32,
    pub array: __u32,
    pub resv1: __u32,
    pub user_addr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_sqring_offsets"][::core::mem::size_of::<io_sqring_offsets>() - 40usize];
    ["Alignment of io_sqring_offsets"][::core::mem::align_of::<io_sqring_offsets>() - 8usize];
    ["Offset of field: io_sqring_offsets::head"]
        [::core::mem::offset_of!(io_sqring_offsets, head) - 0usize];
    ["Offset of field: io_sqring_offsets::tail"]
        [::core::mem::offset_of!(io_sqring_offsets, tail) - 4usize];
    ["Offset of field: io_sqring_offsets::ring_mask"]
        [::core::mem::offset_of!(io_sqring_offsets, ring_mask) - 8usize];
    ["Offset of field: io_sqring_offsets::ring_entries"]
        [::core::mem::offset_of!(io_sqring_offsets, ring_entries) - 12usize];
    ["Offset of field: io_sqring_offsets::flags"]
        [::core::mem::offset_of!(io_sqring_offsets, flags) - 16usize];
    ["Offset of field: io_sqring_offsets::dropped"]
        [::core::mem::offset_of!(io_sqring_offsets, dropped) - 20usize];
    ["Offset of field: io_sqring_offsets::array"]
        [::core::mem::offset_of!(io_sqring_offsets, array) - 24usize];
    ["Offset of field: io_sqring_offsets::resv1"]
        [::core::mem::offset_of!(io_sqring_offsets, resv1) - 28usize];
    ["Offset of field: io_sqring_offsets::user_addr"]
        [::core::mem::offset_of!(io_sqring_offsets, user_addr) - 32usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_cqring_offsets {
    pub head: __u32,
    pub tail: __u32,
    pub ring_mask: __u32,
    pub ring_entries: __u32,
    pub overflow: __u32,
    pub cqes: __u32,
    pub flags: __u32,
    pub resv1: __u32,
    pub user_addr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_cqring_offsets"][::core::mem::size_of::<io_cqring_offsets>() - 40usize];
    ["Alignment of io_cqring_offsets"][::core::mem::align_of::<io_cqring_offsets>() - 8usize];
    ["Offset of field: io_cqring_offsets::head"]
        [::core::mem::offset_of!(io_cqring_offsets, head) - 0usize];
    ["Offset of field: io_cqring_offsets::tail"]
        [::core::mem::offset_of!(io_cqring_offsets, tail) - 4usize];
    ["Offset of field: io_cqring_offsets::ring_mask"]
        [::core::mem::offset_of!(io_cqring_offsets, ring_mask) - 8usize];
    ["Offset of field: io_cqring_offsets::ring_entries"]
        [::core::mem::offset_of!(io_cqring_offsets, ring_entries) - 12usize];
    ["Offset of field: io_cqring_offsets::overflow"]
        [::core::mem::offset_of!(io_cqring_offsets, overflow) - 16usize];
    ["Offset of field: io_cqring_offsets::cqes"]
        [::core::mem::offset_of!(io_cqring_offsets, cqes) - 20usize];
    ["Offset of field: io_cqring_offsets::flags"]
        [::core::mem::offset_of!(io_cqring_offsets, flags) - 24usize];
    ["Offset of field: io_cqring_offsets::resv1"]
        [::core::mem::offset_of!(io_cqring_offsets, resv1) - 28usize];
    ["Offset of field: io_cqring_offsets::user_addr"]
        [::core::mem::offset_of!(io_cqring_offsets, user_addr) - 32usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_params {
    pub sq_entries: __u32,
    pub cq_entries: __u32,
    pub flags: __u32,
    pub sq_thread_cpu: __u32,
    pub sq_thread_idle: __u32,
    pub features: __u32,
    pub wq_fd: __u32,
    pub resv: [__u32; 3usize],
    pub sq_off: io_sqring_offsets,
    pub cq_off: io_cqring_offsets,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_params"][::core::mem::size_of::<io_uring_params>() - 120usize];
    ["Alignment of io_uring_params"][::core::mem::align_of::<io_uring_params>() - 8usize];
    ["Offset of field: io_uring_params::sq_entries"]
        [::core::mem::offset_of!(io_uring_params, sq_entries) - 0usize];
    ["Offset of field: io_uring_params::cq_entries"]
        [::core::mem::offset_of!(io_uring_params, cq_entries) - 4usize];
    ["Offset of field: io_uring_params::flags"]
        [::core::mem::offset_of!(io_uring_params, flags) - 8usize];
    ["Offset of field: io_uring_params::sq_thread_cpu"]
        [::core::mem::offset_of!(io_uring_params, sq_thread_cpu) - 12usize];
    ["Offset of field: io_uring_params::sq_thread_idle"]
        [::core::mem::offset_of!(io_uring_params, sq_thread_idle) - 16usize];
    ["Offset of field: io_uring_params::features"]
        [::core::mem::offset_of!(io_uring_params, features) - 20usize];
    ["Offset of field: io_uring_params::wq_fd"]
        [::core::mem::offset_of!(io_uring_params, wq_fd) - 24usize];
    ["Offset of field: io_uring_params::resv"]
        [::core::mem::offset_of!(io_uring_params, resv) - 28usize];
    ["Offset of field: io_uring_params::sq_off"]
        [::core::mem::offset_of!(io_uring_params, sq_off) - 40usize];
    ["Offset of field: io_uring_params::cq_off"]
        [::core::mem::offset_of!(io_uring_params, cq_off) - 80usize];
};
pub const io_uring_register_op_IORING_REGISTER_BUFFERS: io_uring_register_op = 0;
pub const io_uring_register_op_IORING_UNREGISTER_BUFFERS: io_uring_register_op = 1;
pub const io_uring_register_op_IORING_REGISTER_FILES: io_uring_register_op = 2;
pub const io_uring_register_op_IORING_UNREGISTER_FILES: io_uring_register_op = 3;
pub const io_uring_register_op_IORING_REGISTER_EVENTFD: io_uring_register_op = 4;
pub const io_uring_register_op_IORING_UNREGISTER_EVENTFD: io_uring_register_op = 5;
pub const io_uring_register_op_IORING_REGISTER_FILES_UPDATE: io_uring_register_op = 6;
pub const io_uring_register_op_IORING_REGISTER_EVENTFD_ASYNC: io_uring_register_op = 7;
pub const io_uring_register_op_IORING_REGISTER_PROBE: io_uring_register_op = 8;
pub const io_uring_register_op_IORING_REGISTER_PERSONALITY: io_uring_register_op = 9;
pub const io_uring_register_op_IORING_UNREGISTER_PERSONALITY: io_uring_register_op = 10;
pub const io_uring_register_op_IORING_REGISTER_RESTRICTIONS: io_uring_register_op = 11;
pub const io_uring_register_op_IORING_REGISTER_ENABLE_RINGS: io_uring_register_op = 12;
pub const io_uring_register_op_IORING_REGISTER_FILES2: io_uring_register_op = 13;
pub const io_uring_register_op_IORING_REGISTER_FILES_UPDATE2: io_uring_register_op = 14;
pub const io_uring_register_op_IORING_REGISTER_BUFFERS2: io_uring_register_op = 15;
pub const io_uring_register_op_IORING_REGISTER_BUFFERS_UPDATE: io_uring_register_op = 16;
pub const io_uring_register_op_IORING_REGISTER_IOWQ_AFF: io_uring_register_op = 17;
pub const io_uring_register_op_IORING_UNREGISTER_IOWQ_AFF: io_uring_register_op = 18;
pub const io_uring_register_op_IORING_REGISTER_IOWQ_MAX_WORKERS: io_uring_register_op = 19;
pub const io_uring_register_op_IORING_REGISTER_RING_FDS: io_uring_register_op = 20;
pub const io_uring_register_op_IORING_UNREGISTER_RING_FDS: io_uring_register_op = 21;
pub const io_uring_register_op_IORING_REGISTER_PBUF_RING: io_uring_register_op = 22;
pub const io_uring_register_op_IORING_UNREGISTER_PBUF_RING: io_uring_register_op = 23;
pub const io_uring_register_op_IORING_REGISTER_SYNC_CANCEL: io_uring_register_op = 24;
pub const io_uring_register_op_IORING_REGISTER_FILE_ALLOC_RANGE: io_uring_register_op = 25;
pub const io_uring_register_op_IORING_REGISTER_PBUF_STATUS: io_uring_register_op = 26;
pub const io_uring_register_op_IORING_REGISTER_NAPI: io_uring_register_op = 27;
pub const io_uring_register_op_IORING_UNREGISTER_NAPI: io_uring_register_op = 28;
pub const io_uring_register_op_IORING_REGISTER_CLOCK: io_uring_register_op = 29;
pub const io_uring_register_op_IORING_REGISTER_CLONE_BUFFERS: io_uring_register_op = 30;
pub const io_uring_register_op_IORING_REGISTER_SEND_MSG_RING: io_uring_register_op = 31;
pub const io_uring_register_op_IORING_REGISTER_ZCRX_IFQ: io_uring_register_op = 32;
pub const io_uring_register_op_IORING_REGISTER_RESIZE_RINGS: io_uring_register_op = 33;
pub const io_uring_register_op_IORING_REGISTER_MEM_REGION: io_uring_register_op = 34;
pub const io_uring_register_op_IORING_REGISTER_QUERY: io_uring_register_op = 35;
pub const io_uring_register_op_IORING_REGISTER_ZCRX_CTRL: io_uring_register_op = 36;
pub const io_uring_register_op_IORING_REGISTER_LAST: io_uring_register_op = 37;
pub const io_uring_register_op_IORING_REGISTER_USE_REGISTERED_RING: io_uring_register_op =
    2147483648;
pub type io_uring_register_op = ::core::ffi::c_uint;
pub const io_wq_type_IO_WQ_BOUND: io_wq_type = 0;
pub const io_wq_type_IO_WQ_UNBOUND: io_wq_type = 1;
pub type io_wq_type = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_files_update {
    pub offset: __u32,
    pub resv: __u32,
    pub fds: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_files_update"][::core::mem::size_of::<io_uring_files_update>() - 16usize];
    ["Alignment of io_uring_files_update"]
        [::core::mem::align_of::<io_uring_files_update>() - 8usize];
    ["Offset of field: io_uring_files_update::offset"]
        [::core::mem::offset_of!(io_uring_files_update, offset) - 0usize];
    ["Offset of field: io_uring_files_update::resv"]
        [::core::mem::offset_of!(io_uring_files_update, resv) - 4usize];
    ["Offset of field: io_uring_files_update::fds"]
        [::core::mem::offset_of!(io_uring_files_update, fds) - 8usize];
};
pub const IORING_MEM_REGION_TYPE_USER: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_region_desc {
    pub user_addr: __u64,
    pub size: __u64,
    pub flags: __u32,
    pub id: __u32,
    pub mmap_offset: __u64,
    pub __resv: [__u64; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_region_desc"][::core::mem::size_of::<io_uring_region_desc>() - 64usize];
    ["Alignment of io_uring_region_desc"][::core::mem::align_of::<io_uring_region_desc>() - 8usize];
    ["Offset of field: io_uring_region_desc::user_addr"]
        [::core::mem::offset_of!(io_uring_region_desc, user_addr) - 0usize];
    ["Offset of field: io_uring_region_desc::size"]
        [::core::mem::offset_of!(io_uring_region_desc, size) - 8usize];
    ["Offset of field: io_uring_region_desc::flags"]
        [::core::mem::offset_of!(io_uring_region_desc, flags) - 16usize];
    ["Offset of field: io_uring_region_desc::id"]
        [::core::mem::offset_of!(io_uring_region_desc, id) - 20usize];
    ["Offset of field: io_uring_region_desc::mmap_offset"]
        [::core::mem::offset_of!(io_uring_region_desc, mmap_offset) - 24usize];
    ["Offset of field: io_uring_region_desc::__resv"]
        [::core::mem::offset_of!(io_uring_region_desc, __resv) - 32usize];
};
pub const IORING_MEM_REGION_REG_WAIT_ARG: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_mem_region_reg {
    pub region_uptr: __u64,
    pub flags: __u64,
    pub __resv: [__u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_mem_region_reg"]
        [::core::mem::size_of::<io_uring_mem_region_reg>() - 32usize];
    ["Alignment of io_uring_mem_region_reg"]
        [::core::mem::align_of::<io_uring_mem_region_reg>() - 8usize];
    ["Offset of field: io_uring_mem_region_reg::region_uptr"]
        [::core::mem::offset_of!(io_uring_mem_region_reg, region_uptr) - 0usize];
    ["Offset of field: io_uring_mem_region_reg::flags"]
        [::core::mem::offset_of!(io_uring_mem_region_reg, flags) - 8usize];
    ["Offset of field: io_uring_mem_region_reg::__resv"]
        [::core::mem::offset_of!(io_uring_mem_region_reg, __resv) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_rsrc_register {
    pub nr: __u32,
    pub flags: __u32,
    pub resv2: __u64,
    pub data: __u64,
    pub tags: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_rsrc_register"][::core::mem::size_of::<io_uring_rsrc_register>() - 32usize];
    ["Alignment of io_uring_rsrc_register"]
        [::core::mem::align_of::<io_uring_rsrc_register>() - 8usize];
    ["Offset of field: io_uring_rsrc_register::nr"]
        [::core::mem::offset_of!(io_uring_rsrc_register, nr) - 0usize];
    ["Offset of field: io_uring_rsrc_register::flags"]
        [::core::mem::offset_of!(io_uring_rsrc_register, flags) - 4usize];
    ["Offset of field: io_uring_rsrc_register::resv2"]
        [::core::mem::offset_of!(io_uring_rsrc_register, resv2) - 8usize];
    ["Offset of field: io_uring_rsrc_register::data"]
        [::core::mem::offset_of!(io_uring_rsrc_register, data) - 16usize];
    ["Offset of field: io_uring_rsrc_register::tags"]
        [::core::mem::offset_of!(io_uring_rsrc_register, tags) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_rsrc_update {
    pub offset: __u32,
    pub resv: __u32,
    pub data: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_rsrc_update"][::core::mem::size_of::<io_uring_rsrc_update>() - 16usize];
    ["Alignment of io_uring_rsrc_update"][::core::mem::align_of::<io_uring_rsrc_update>() - 8usize];
    ["Offset of field: io_uring_rsrc_update::offset"]
        [::core::mem::offset_of!(io_uring_rsrc_update, offset) - 0usize];
    ["Offset of field: io_uring_rsrc_update::resv"]
        [::core::mem::offset_of!(io_uring_rsrc_update, resv) - 4usize];
    ["Offset of field: io_uring_rsrc_update::data"]
        [::core::mem::offset_of!(io_uring_rsrc_update, data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_rsrc_update2 {
    pub offset: __u32,
    pub resv: __u32,
    pub data: __u64,
    pub tags: __u64,
    pub nr: __u32,
    pub resv2: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_rsrc_update2"][::core::mem::size_of::<io_uring_rsrc_update2>() - 32usize];
    ["Alignment of io_uring_rsrc_update2"]
        [::core::mem::align_of::<io_uring_rsrc_update2>() - 8usize];
    ["Offset of field: io_uring_rsrc_update2::offset"]
        [::core::mem::offset_of!(io_uring_rsrc_update2, offset) - 0usize];
    ["Offset of field: io_uring_rsrc_update2::resv"]
        [::core::mem::offset_of!(io_uring_rsrc_update2, resv) - 4usize];
    ["Offset of field: io_uring_rsrc_update2::data"]
        [::core::mem::offset_of!(io_uring_rsrc_update2, data) - 8usize];
    ["Offset of field: io_uring_rsrc_update2::tags"]
        [::core::mem::offset_of!(io_uring_rsrc_update2, tags) - 16usize];
    ["Offset of field: io_uring_rsrc_update2::nr"]
        [::core::mem::offset_of!(io_uring_rsrc_update2, nr) - 24usize];
    ["Offset of field: io_uring_rsrc_update2::resv2"]
        [::core::mem::offset_of!(io_uring_rsrc_update2, resv2) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_probe_op {
    pub op: __u8,
    pub resv: __u8,
    pub flags: __u16,
    pub resv2: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_probe_op"][::core::mem::size_of::<io_uring_probe_op>() - 8usize];
    ["Alignment of io_uring_probe_op"][::core::mem::align_of::<io_uring_probe_op>() - 4usize];
    ["Offset of field: io_uring_probe_op::op"]
        [::core::mem::offset_of!(io_uring_probe_op, op) - 0usize];
    ["Offset of field: io_uring_probe_op::resv"]
        [::core::mem::offset_of!(io_uring_probe_op, resv) - 1usize];
    ["Offset of field: io_uring_probe_op::flags"]
        [::core::mem::offset_of!(io_uring_probe_op, flags) - 2usize];
    ["Offset of field: io_uring_probe_op::resv2"]
        [::core::mem::offset_of!(io_uring_probe_op, resv2) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct io_uring_probe {
    pub last_op: __u8,
    pub ops_len: __u8,
    pub resv: __u16,
    pub resv2: [__u32; 3usize],
    pub ops: __IncompleteArrayField<io_uring_probe_op>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_probe"][::core::mem::size_of::<io_uring_probe>() - 16usize];
    ["Alignment of io_uring_probe"][::core::mem::align_of::<io_uring_probe>() - 4usize];
    ["Offset of field: io_uring_probe::last_op"]
        [::core::mem::offset_of!(io_uring_probe, last_op) - 0usize];
    ["Offset of field: io_uring_probe::ops_len"]
        [::core::mem::offset_of!(io_uring_probe, ops_len) - 1usize];
    ["Offset of field: io_uring_probe::resv"]
        [::core::mem::offset_of!(io_uring_probe, resv) - 2usize];
    ["Offset of field: io_uring_probe::resv2"]
        [::core::mem::offset_of!(io_uring_probe, resv2) - 4usize];
    ["Offset of field: io_uring_probe::ops"]
        [::core::mem::offset_of!(io_uring_probe, ops) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct io_uring_restriction {
    pub opcode: __u16,
    pub __bindgen_anon_1: io_uring_restriction__bindgen_ty_1,
    pub resv: __u8,
    pub resv2: [__u32; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_uring_restriction__bindgen_ty_1 {
    pub register_op: __u8,
    pub sqe_op: __u8,
    pub sqe_flags: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_restriction__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_restriction__bindgen_ty_1>() - 1usize];
    ["Alignment of io_uring_restriction__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_restriction__bindgen_ty_1>() - 1usize];
    ["Offset of field: io_uring_restriction__bindgen_ty_1::register_op"]
        [::core::mem::offset_of!(io_uring_restriction__bindgen_ty_1, register_op) - 0usize];
    ["Offset of field: io_uring_restriction__bindgen_ty_1::sqe_op"]
        [::core::mem::offset_of!(io_uring_restriction__bindgen_ty_1, sqe_op) - 0usize];
    ["Offset of field: io_uring_restriction__bindgen_ty_1::sqe_flags"]
        [::core::mem::offset_of!(io_uring_restriction__bindgen_ty_1, sqe_flags) - 0usize];
};
impl Default for io_uring_restriction__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_restriction"][::core::mem::size_of::<io_uring_restriction>() - 16usize];
    ["Alignment of io_uring_restriction"][::core::mem::align_of::<io_uring_restriction>() - 4usize];
    ["Offset of field: io_uring_restriction::opcode"]
        [::core::mem::offset_of!(io_uring_restriction, opcode) - 0usize];
    ["Offset of field: io_uring_restriction::resv"]
        [::core::mem::offset_of!(io_uring_restriction, resv) - 3usize];
    ["Offset of field: io_uring_restriction::resv2"]
        [::core::mem::offset_of!(io_uring_restriction, resv2) - 4usize];
};
impl Default for io_uring_restriction {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_clock_register {
    pub clockid: __u32,
    pub __resv: [__u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_clock_register"]
        [::core::mem::size_of::<io_uring_clock_register>() - 16usize];
    ["Alignment of io_uring_clock_register"]
        [::core::mem::align_of::<io_uring_clock_register>() - 4usize];
    ["Offset of field: io_uring_clock_register::clockid"]
        [::core::mem::offset_of!(io_uring_clock_register, clockid) - 0usize];
    ["Offset of field: io_uring_clock_register::__resv"]
        [::core::mem::offset_of!(io_uring_clock_register, __resv) - 4usize];
};
pub const IORING_REGISTER_SRC_REGISTERED: _bindgen_ty_3 = 1;
pub const IORING_REGISTER_DST_REPLACE: _bindgen_ty_3 = 2;
pub type _bindgen_ty_3 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_clone_buffers {
    pub src_fd: __u32,
    pub flags: __u32,
    pub src_off: __u32,
    pub dst_off: __u32,
    pub nr: __u32,
    pub pad: [__u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_clone_buffers"][::core::mem::size_of::<io_uring_clone_buffers>() - 32usize];
    ["Alignment of io_uring_clone_buffers"]
        [::core::mem::align_of::<io_uring_clone_buffers>() - 4usize];
    ["Offset of field: io_uring_clone_buffers::src_fd"]
        [::core::mem::offset_of!(io_uring_clone_buffers, src_fd) - 0usize];
    ["Offset of field: io_uring_clone_buffers::flags"]
        [::core::mem::offset_of!(io_uring_clone_buffers, flags) - 4usize];
    ["Offset of field: io_uring_clone_buffers::src_off"]
        [::core::mem::offset_of!(io_uring_clone_buffers, src_off) - 8usize];
    ["Offset of field: io_uring_clone_buffers::dst_off"]
        [::core::mem::offset_of!(io_uring_clone_buffers, dst_off) - 12usize];
    ["Offset of field: io_uring_clone_buffers::nr"]
        [::core::mem::offset_of!(io_uring_clone_buffers, nr) - 16usize];
    ["Offset of field: io_uring_clone_buffers::pad"]
        [::core::mem::offset_of!(io_uring_clone_buffers, pad) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_buf {
    pub addr: __u64,
    pub len: __u32,
    pub bid: __u16,
    pub resv: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf"][::core::mem::size_of::<io_uring_buf>() - 16usize];
    ["Alignment of io_uring_buf"][::core::mem::align_of::<io_uring_buf>() - 8usize];
    ["Offset of field: io_uring_buf::addr"][::core::mem::offset_of!(io_uring_buf, addr) - 0usize];
    ["Offset of field: io_uring_buf::len"][::core::mem::offset_of!(io_uring_buf, len) - 8usize];
    ["Offset of field: io_uring_buf::bid"][::core::mem::offset_of!(io_uring_buf, bid) - 12usize];
    ["Offset of field: io_uring_buf::resv"][::core::mem::offset_of!(io_uring_buf, resv) - 14usize];
};
#[repr(C)]
pub struct io_uring_buf_ring {
    pub __bindgen_anon_1: io_uring_buf_ring__bindgen_ty_1,
}
#[repr(C)]
pub struct io_uring_buf_ring__bindgen_ty_1 {
    pub __bindgen_anon_1: __BindgenUnionField<io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1>,
    pub __bindgen_anon_2: __BindgenUnionField<io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2>,
    pub bindgen_union_field: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1 {
    pub resv1: __u64,
    pub resv2: __u32,
    pub resv3: __u16,
    pub tail: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1::resv1"]
        [::core::mem::offset_of!(io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1, resv1) - 0usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1::resv2"]
        [::core::mem::offset_of!(io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1, resv2) - 8usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1::resv3"]
        [::core::mem::offset_of!(io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1, resv3) - 12usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1::tail"]
        [::core::mem::offset_of!(io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1, tail) - 14usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2 {
    pub __empty_bufs: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
    pub bufs: __IncompleteArrayField<io_uring_buf>,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1"][::core::mem::size_of::<
        io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
    >() - 0usize];
    ["Alignment of io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>()
            - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2>() - 0usize];
    ["Alignment of io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2::__empty_bufs"][::core::mem::offset_of!(
        io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2,
        __empty_bufs
    ) - 0usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2::bufs"]
        [::core::mem::offset_of!(io_uring_buf_ring__bindgen_ty_1__bindgen_ty_2, bufs) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_ring__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_buf_ring__bindgen_ty_1>() - 16usize];
    ["Alignment of io_uring_buf_ring__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_buf_ring__bindgen_ty_1>() - 8usize];
};
impl Default for io_uring_buf_ring__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_ring"][::core::mem::size_of::<io_uring_buf_ring>() - 16usize];
    ["Alignment of io_uring_buf_ring"][::core::mem::align_of::<io_uring_buf_ring>() - 8usize];
};
impl Default for io_uring_buf_ring {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const io_uring_register_pbuf_ring_flags_IOU_PBUF_RING_MMAP: io_uring_register_pbuf_ring_flags =
    1;
pub const io_uring_register_pbuf_ring_flags_IOU_PBUF_RING_INC: io_uring_register_pbuf_ring_flags =
    2;
pub type io_uring_register_pbuf_ring_flags = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_buf_reg {
    pub ring_addr: __u64,
    pub ring_entries: __u32,
    pub bgid: __u16,
    pub flags: __u16,
    pub resv: [__u64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_reg"][::core::mem::size_of::<io_uring_buf_reg>() - 40usize];
    ["Alignment of io_uring_buf_reg"][::core::mem::align_of::<io_uring_buf_reg>() - 8usize];
    ["Offset of field: io_uring_buf_reg::ring_addr"]
        [::core::mem::offset_of!(io_uring_buf_reg, ring_addr) - 0usize];
    ["Offset of field: io_uring_buf_reg::ring_entries"]
        [::core::mem::offset_of!(io_uring_buf_reg, ring_entries) - 8usize];
    ["Offset of field: io_uring_buf_reg::bgid"]
        [::core::mem::offset_of!(io_uring_buf_reg, bgid) - 12usize];
    ["Offset of field: io_uring_buf_reg::flags"]
        [::core::mem::offset_of!(io_uring_buf_reg, flags) - 14usize];
    ["Offset of field: io_uring_buf_reg::resv"]
        [::core::mem::offset_of!(io_uring_buf_reg, resv) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_buf_status {
    pub buf_group: __u32,
    pub head: __u32,
    pub resv: [__u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_status"][::core::mem::size_of::<io_uring_buf_status>() - 40usize];
    ["Alignment of io_uring_buf_status"][::core::mem::align_of::<io_uring_buf_status>() - 4usize];
    ["Offset of field: io_uring_buf_status::buf_group"]
        [::core::mem::offset_of!(io_uring_buf_status, buf_group) - 0usize];
    ["Offset of field: io_uring_buf_status::head"]
        [::core::mem::offset_of!(io_uring_buf_status, head) - 4usize];
    ["Offset of field: io_uring_buf_status::resv"]
        [::core::mem::offset_of!(io_uring_buf_status, resv) - 8usize];
};
pub const io_uring_napi_op_IO_URING_NAPI_REGISTER_OP: io_uring_napi_op = 0;
pub const io_uring_napi_op_IO_URING_NAPI_STATIC_ADD_ID: io_uring_napi_op = 1;
pub const io_uring_napi_op_IO_URING_NAPI_STATIC_DEL_ID: io_uring_napi_op = 2;
pub type io_uring_napi_op = ::core::ffi::c_uint;
pub const io_uring_napi_tracking_strategy_IO_URING_NAPI_TRACKING_DYNAMIC:
    io_uring_napi_tracking_strategy = 0;
pub const io_uring_napi_tracking_strategy_IO_URING_NAPI_TRACKING_STATIC:
    io_uring_napi_tracking_strategy = 1;
pub const io_uring_napi_tracking_strategy_IO_URING_NAPI_TRACKING_INACTIVE:
    io_uring_napi_tracking_strategy = 255;
pub type io_uring_napi_tracking_strategy = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_napi {
    pub busy_poll_to: __u32,
    pub prefer_busy_poll: __u8,
    pub opcode: __u8,
    pub pad: [__u8; 2usize],
    pub op_param: __u32,
    pub resv: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_napi"][::core::mem::size_of::<io_uring_napi>() - 16usize];
    ["Alignment of io_uring_napi"][::core::mem::align_of::<io_uring_napi>() - 4usize];
    ["Offset of field: io_uring_napi::busy_poll_to"]
        [::core::mem::offset_of!(io_uring_napi, busy_poll_to) - 0usize];
    ["Offset of field: io_uring_napi::prefer_busy_poll"]
        [::core::mem::offset_of!(io_uring_napi, prefer_busy_poll) - 4usize];
    ["Offset of field: io_uring_napi::opcode"]
        [::core::mem::offset_of!(io_uring_napi, opcode) - 5usize];
    ["Offset of field: io_uring_napi::pad"][::core::mem::offset_of!(io_uring_napi, pad) - 6usize];
    ["Offset of field: io_uring_napi::op_param"]
        [::core::mem::offset_of!(io_uring_napi, op_param) - 8usize];
    ["Offset of field: io_uring_napi::resv"]
        [::core::mem::offset_of!(io_uring_napi, resv) - 12usize];
};
pub const io_uring_register_restriction_op_IORING_RESTRICTION_REGISTER_OP:
    io_uring_register_restriction_op = 0;
pub const io_uring_register_restriction_op_IORING_RESTRICTION_SQE_OP:
    io_uring_register_restriction_op = 1;
pub const io_uring_register_restriction_op_IORING_RESTRICTION_SQE_FLAGS_ALLOWED:
    io_uring_register_restriction_op = 2;
pub const io_uring_register_restriction_op_IORING_RESTRICTION_SQE_FLAGS_REQUIRED:
    io_uring_register_restriction_op = 3;
pub const io_uring_register_restriction_op_IORING_RESTRICTION_LAST:
    io_uring_register_restriction_op = 4;
pub type io_uring_register_restriction_op = ::core::ffi::c_uint;
pub const IORING_REG_WAIT_TS: _bindgen_ty_4 = 1;
pub type _bindgen_ty_4 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_reg_wait {
    pub ts: __kernel_timespec,
    pub min_wait_usec: __u32,
    pub flags: __u32,
    pub sigmask: __u64,
    pub sigmask_sz: __u32,
    pub pad: [__u32; 3usize],
    pub pad2: [__u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_reg_wait"][::core::mem::size_of::<io_uring_reg_wait>() - 64usize];
    ["Alignment of io_uring_reg_wait"][::core::mem::align_of::<io_uring_reg_wait>() - 8usize];
    ["Offset of field: io_uring_reg_wait::ts"]
        [::core::mem::offset_of!(io_uring_reg_wait, ts) - 0usize];
    ["Offset of field: io_uring_reg_wait::min_wait_usec"]
        [::core::mem::offset_of!(io_uring_reg_wait, min_wait_usec) - 16usize];
    ["Offset of field: io_uring_reg_wait::flags"]
        [::core::mem::offset_of!(io_uring_reg_wait, flags) - 20usize];
    ["Offset of field: io_uring_reg_wait::sigmask"]
        [::core::mem::offset_of!(io_uring_reg_wait, sigmask) - 24usize];
    ["Offset of field: io_uring_reg_wait::sigmask_sz"]
        [::core::mem::offset_of!(io_uring_reg_wait, sigmask_sz) - 32usize];
    ["Offset of field: io_uring_reg_wait::pad"]
        [::core::mem::offset_of!(io_uring_reg_wait, pad) - 36usize];
    ["Offset of field: io_uring_reg_wait::pad2"]
        [::core::mem::offset_of!(io_uring_reg_wait, pad2) - 48usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_getevents_arg {
    pub sigmask: __u64,
    pub sigmask_sz: __u32,
    pub min_wait_usec: __u32,
    pub ts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_getevents_arg"][::core::mem::size_of::<io_uring_getevents_arg>() - 24usize];
    ["Alignment of io_uring_getevents_arg"]
        [::core::mem::align_of::<io_uring_getevents_arg>() - 8usize];
    ["Offset of field: io_uring_getevents_arg::sigmask"]
        [::core::mem::offset_of!(io_uring_getevents_arg, sigmask) - 0usize];
    ["Offset of field: io_uring_getevents_arg::sigmask_sz"]
        [::core::mem::offset_of!(io_uring_getevents_arg, sigmask_sz) - 8usize];
    ["Offset of field: io_uring_getevents_arg::min_wait_usec"]
        [::core::mem::offset_of!(io_uring_getevents_arg, min_wait_usec) - 12usize];
    ["Offset of field: io_uring_getevents_arg::ts"]
        [::core::mem::offset_of!(io_uring_getevents_arg, ts) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sync_cancel_reg {
    pub addr: __u64,
    pub fd: __s32,
    pub flags: __u32,
    pub timeout: __kernel_timespec,
    pub opcode: __u8,
    pub pad: [__u8; 7usize],
    pub pad2: [__u64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sync_cancel_reg"]
        [::core::mem::size_of::<io_uring_sync_cancel_reg>() - 64usize];
    ["Alignment of io_uring_sync_cancel_reg"]
        [::core::mem::align_of::<io_uring_sync_cancel_reg>() - 8usize];
    ["Offset of field: io_uring_sync_cancel_reg::addr"]
        [::core::mem::offset_of!(io_uring_sync_cancel_reg, addr) - 0usize];
    ["Offset of field: io_uring_sync_cancel_reg::fd"]
        [::core::mem::offset_of!(io_uring_sync_cancel_reg, fd) - 8usize];
    ["Offset of field: io_uring_sync_cancel_reg::flags"]
        [::core::mem::offset_of!(io_uring_sync_cancel_reg, flags) - 12usize];
    ["Offset of field: io_uring_sync_cancel_reg::timeout"]
        [::core::mem::offset_of!(io_uring_sync_cancel_reg, timeout) - 16usize];
    ["Offset of field: io_uring_sync_cancel_reg::opcode"]
        [::core::mem::offset_of!(io_uring_sync_cancel_reg, opcode) - 32usize];
    ["Offset of field: io_uring_sync_cancel_reg::pad"]
        [::core::mem::offset_of!(io_uring_sync_cancel_reg, pad) - 33usize];
    ["Offset of field: io_uring_sync_cancel_reg::pad2"]
        [::core::mem::offset_of!(io_uring_sync_cancel_reg, pad2) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_file_index_range {
    pub off: __u32,
    pub len: __u32,
    pub resv: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_file_index_range"]
        [::core::mem::size_of::<io_uring_file_index_range>() - 16usize];
    ["Alignment of io_uring_file_index_range"]
        [::core::mem::align_of::<io_uring_file_index_range>() - 8usize];
    ["Offset of field: io_uring_file_index_range::off"]
        [::core::mem::offset_of!(io_uring_file_index_range, off) - 0usize];
    ["Offset of field: io_uring_file_index_range::len"]
        [::core::mem::offset_of!(io_uring_file_index_range, len) - 4usize];
    ["Offset of field: io_uring_file_index_range::resv"]
        [::core::mem::offset_of!(io_uring_file_index_range, resv) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_recvmsg_out {
    pub namelen: __u32,
    pub controllen: __u32,
    pub payloadlen: __u32,
    pub flags: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_recvmsg_out"][::core::mem::size_of::<io_uring_recvmsg_out>() - 16usize];
    ["Alignment of io_uring_recvmsg_out"][::core::mem::align_of::<io_uring_recvmsg_out>() - 4usize];
    ["Offset of field: io_uring_recvmsg_out::namelen"]
        [::core::mem::offset_of!(io_uring_recvmsg_out, namelen) - 0usize];
    ["Offset of field: io_uring_recvmsg_out::controllen"]
        [::core::mem::offset_of!(io_uring_recvmsg_out, controllen) - 4usize];
    ["Offset of field: io_uring_recvmsg_out::payloadlen"]
        [::core::mem::offset_of!(io_uring_recvmsg_out, payloadlen) - 8usize];
    ["Offset of field: io_uring_recvmsg_out::flags"]
        [::core::mem::offset_of!(io_uring_recvmsg_out, flags) - 12usize];
};
pub const io_uring_socket_op_SOCKET_URING_OP_SIOCINQ: io_uring_socket_op = 0;
pub const io_uring_socket_op_SOCKET_URING_OP_SIOCOUTQ: io_uring_socket_op = 1;
pub const io_uring_socket_op_SOCKET_URING_OP_GETSOCKOPT: io_uring_socket_op = 2;
pub const io_uring_socket_op_SOCKET_URING_OP_SETSOCKOPT: io_uring_socket_op = 3;
pub const io_uring_socket_op_SOCKET_URING_OP_TX_TIMESTAMP: io_uring_socket_op = 4;
pub const io_uring_socket_op_SOCKET_URING_OP_GETSOCKNAME: io_uring_socket_op = 5;
pub type io_uring_socket_op = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_timespec {
    pub tv_sec: __u64,
    pub tv_nsec: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_timespec"][::core::mem::size_of::<io_timespec>() - 16usize];
    ["Alignment of io_timespec"][::core::mem::align_of::<io_timespec>() - 8usize];
    ["Offset of field: io_timespec::tv_sec"][::core::mem::offset_of!(io_timespec, tv_sec) - 0usize];
    ["Offset of field: io_timespec::tv_nsec"]
        [::core::mem::offset_of!(io_timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_zcrx_rqe {
    pub off: __u64,
    pub len: __u32,
    pub __pad: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_zcrx_rqe"][::core::mem::size_of::<io_uring_zcrx_rqe>() - 16usize];
    ["Alignment of io_uring_zcrx_rqe"][::core::mem::align_of::<io_uring_zcrx_rqe>() - 8usize];
    ["Offset of field: io_uring_zcrx_rqe::off"]
        [::core::mem::offset_of!(io_uring_zcrx_rqe, off) - 0usize];
    ["Offset of field: io_uring_zcrx_rqe::len"]
        [::core::mem::offset_of!(io_uring_zcrx_rqe, len) - 8usize];
    ["Offset of field: io_uring_zcrx_rqe::__pad"]
        [::core::mem::offset_of!(io_uring_zcrx_rqe, __pad) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_zcrx_cqe {
    pub off: __u64,
    pub __pad: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_zcrx_cqe"][::core::mem::size_of::<io_uring_zcrx_cqe>() - 16usize];
    ["Alignment of io_uring_zcrx_cqe"][::core::mem::align_of::<io_uring_zcrx_cqe>() - 8usize];
    ["Offset of field: io_uring_zcrx_cqe::off"]
        [::core::mem::offset_of!(io_uring_zcrx_cqe, off) - 0usize];
    ["Offset of field: io_uring_zcrx_cqe::__pad"]
        [::core::mem::offset_of!(io_uring_zcrx_cqe, __pad) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_zcrx_offsets {
    pub head: __u32,
    pub tail: __u32,
    pub rqes: __u32,
    pub __resv2: __u32,
    pub __resv: [__u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_zcrx_offsets"][::core::mem::size_of::<io_uring_zcrx_offsets>() - 32usize];
    ["Alignment of io_uring_zcrx_offsets"]
        [::core::mem::align_of::<io_uring_zcrx_offsets>() - 8usize];
    ["Offset of field: io_uring_zcrx_offsets::head"]
        [::core::mem::offset_of!(io_uring_zcrx_offsets, head) - 0usize];
    ["Offset of field: io_uring_zcrx_offsets::tail"]
        [::core::mem::offset_of!(io_uring_zcrx_offsets, tail) - 4usize];
    ["Offset of field: io_uring_zcrx_offsets::rqes"]
        [::core::mem::offset_of!(io_uring_zcrx_offsets, rqes) - 8usize];
    ["Offset of field: io_uring_zcrx_offsets::__resv2"]
        [::core::mem::offset_of!(io_uring_zcrx_offsets, __resv2) - 12usize];
    ["Offset of field: io_uring_zcrx_offsets::__resv"]
        [::core::mem::offset_of!(io_uring_zcrx_offsets, __resv) - 16usize];
};
pub const io_uring_zcrx_area_flags_IORING_ZCRX_AREA_DMABUF: io_uring_zcrx_area_flags = 1;
pub type io_uring_zcrx_area_flags = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_zcrx_area_reg {
    pub addr: __u64,
    pub len: __u64,
    pub rq_area_token: __u64,
    pub flags: __u32,
    pub dmabuf_fd: __u32,
    pub __resv2: [__u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_zcrx_area_reg"][::core::mem::size_of::<io_uring_zcrx_area_reg>() - 48usize];
    ["Alignment of io_uring_zcrx_area_reg"]
        [::core::mem::align_of::<io_uring_zcrx_area_reg>() - 8usize];
    ["Offset of field: io_uring_zcrx_area_reg::addr"]
        [::core::mem::offset_of!(io_uring_zcrx_area_reg, addr) - 0usize];
    ["Offset of field: io_uring_zcrx_area_reg::len"]
        [::core::mem::offset_of!(io_uring_zcrx_area_reg, len) - 8usize];
    ["Offset of field: io_uring_zcrx_area_reg::rq_area_token"]
        [::core::mem::offset_of!(io_uring_zcrx_area_reg, rq_area_token) - 16usize];
    ["Offset of field: io_uring_zcrx_area_reg::flags"]
        [::core::mem::offset_of!(io_uring_zcrx_area_reg, flags) - 24usize];
    ["Offset of field: io_uring_zcrx_area_reg::dmabuf_fd"]
        [::core::mem::offset_of!(io_uring_zcrx_area_reg, dmabuf_fd) - 28usize];
    ["Offset of field: io_uring_zcrx_area_reg::__resv2"]
        [::core::mem::offset_of!(io_uring_zcrx_area_reg, __resv2) - 32usize];
};
pub const zcrx_reg_flags_ZCRX_REG_IMPORT: zcrx_reg_flags = 1;
pub type zcrx_reg_flags = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_zcrx_ifq_reg {
    pub if_idx: __u32,
    pub if_rxq: __u32,
    pub rq_entries: __u32,
    pub flags: __u32,
    pub area_ptr: __u64,
    pub region_ptr: __u64,
    pub offsets: io_uring_zcrx_offsets,
    pub zcrx_id: __u32,
    pub __resv2: __u32,
    pub __resv: [__u64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_zcrx_ifq_reg"][::core::mem::size_of::<io_uring_zcrx_ifq_reg>() - 96usize];
    ["Alignment of io_uring_zcrx_ifq_reg"]
        [::core::mem::align_of::<io_uring_zcrx_ifq_reg>() - 8usize];
    ["Offset of field: io_uring_zcrx_ifq_reg::if_idx"]
        [::core::mem::offset_of!(io_uring_zcrx_ifq_reg, if_idx) - 0usize];
    ["Offset of field: io_uring_zcrx_ifq_reg::if_rxq"]
        [::core::mem::offset_of!(io_uring_zcrx_ifq_reg, if_rxq) - 4usize];
    ["Offset of field: io_uring_zcrx_ifq_reg::rq_entries"]
        [::core::mem::offset_of!(io_uring_zcrx_ifq_reg, rq_entries) - 8usize];
    ["Offset of field: io_uring_zcrx_ifq_reg::flags"]
        [::core::mem::offset_of!(io_uring_zcrx_ifq_reg, flags) - 12usize];
    ["Offset of field: io_uring_zcrx_ifq_reg::area_ptr"]
        [::core::mem::offset_of!(io_uring_zcrx_ifq_reg, area_ptr) - 16usize];
    ["Offset of field: io_uring_zcrx_ifq_reg::region_ptr"]
        [::core::mem::offset_of!(io_uring_zcrx_ifq_reg, region_ptr) - 24usize];
    ["Offset of field: io_uring_zcrx_ifq_reg::offsets"]
        [::core::mem::offset_of!(io_uring_zcrx_ifq_reg, offsets) - 32usize];
    ["Offset of field: io_uring_zcrx_ifq_reg::zcrx_id"]
        [::core::mem::offset_of!(io_uring_zcrx_ifq_reg, zcrx_id) - 64usize];
    ["Offset of field: io_uring_zcrx_ifq_reg::__resv2"]
        [::core::mem::offset_of!(io_uring_zcrx_ifq_reg, __resv2) - 68usize];
    ["Offset of field: io_uring_zcrx_ifq_reg::__resv"]
        [::core::mem::offset_of!(io_uring_zcrx_ifq_reg, __resv) - 72usize];
};
pub const zcrx_ctrl_op_ZCRX_CTRL_FLUSH_RQ: zcrx_ctrl_op = 0;
pub const zcrx_ctrl_op_ZCRX_CTRL_EXPORT: zcrx_ctrl_op = 1;
pub const zcrx_ctrl_op___ZCRX_CTRL_LAST: zcrx_ctrl_op = 2;
pub type zcrx_ctrl_op = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct zcrx_ctrl_flush_rq {
    pub __resv: [__u64; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zcrx_ctrl_flush_rq"][::core::mem::size_of::<zcrx_ctrl_flush_rq>() - 48usize];
    ["Alignment of zcrx_ctrl_flush_rq"][::core::mem::align_of::<zcrx_ctrl_flush_rq>() - 8usize];
    ["Offset of field: zcrx_ctrl_flush_rq::__resv"]
        [::core::mem::offset_of!(zcrx_ctrl_flush_rq, __resv) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct zcrx_ctrl_export {
    pub zcrx_fd: __u32,
    pub __resv1: [__u32; 11usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zcrx_ctrl_export"][::core::mem::size_of::<zcrx_ctrl_export>() - 48usize];
    ["Alignment of zcrx_ctrl_export"][::core::mem::align_of::<zcrx_ctrl_export>() - 4usize];
    ["Offset of field: zcrx_ctrl_export::zcrx_fd"]
        [::core::mem::offset_of!(zcrx_ctrl_export, zcrx_fd) - 0usize];
    ["Offset of field: zcrx_ctrl_export::__resv1"]
        [::core::mem::offset_of!(zcrx_ctrl_export, __resv1) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct zcrx_ctrl {
    pub zcrx_id: __u32,
    pub op: __u32,
    pub __resv: [__u64; 2usize],
    pub __bindgen_anon_1: zcrx_ctrl__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union zcrx_ctrl__bindgen_ty_1 {
    pub zc_export: zcrx_ctrl_export,
    pub zc_flush: zcrx_ctrl_flush_rq,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zcrx_ctrl__bindgen_ty_1"]
        [::core::mem::size_of::<zcrx_ctrl__bindgen_ty_1>() - 48usize];
    ["Alignment of zcrx_ctrl__bindgen_ty_1"]
        [::core::mem::align_of::<zcrx_ctrl__bindgen_ty_1>() - 8usize];
    ["Offset of field: zcrx_ctrl__bindgen_ty_1::zc_export"]
        [::core::mem::offset_of!(zcrx_ctrl__bindgen_ty_1, zc_export) - 0usize];
    ["Offset of field: zcrx_ctrl__bindgen_ty_1::zc_flush"]
        [::core::mem::offset_of!(zcrx_ctrl__bindgen_ty_1, zc_flush) - 0usize];
};
impl Default for zcrx_ctrl__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of zcrx_ctrl"][::core::mem::size_of::<zcrx_ctrl>() - 72usize];
    ["Alignment of zcrx_ctrl"][::core::mem::align_of::<zcrx_ctrl>() - 8usize];
    ["Offset of field: zcrx_ctrl::zcrx_id"][::core::mem::offset_of!(zcrx_ctrl, zcrx_id) - 0usize];
    ["Offset of field: zcrx_ctrl::op"][::core::mem::offset_of!(zcrx_ctrl, op) - 4usize];
    ["Offset of field: zcrx_ctrl::__resv"][::core::mem::offset_of!(zcrx_ctrl, __resv) - 8usize];
};
impl Default for zcrx_ctrl {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
